[{"c":"ACBS 311","n":"Understanding Dog and Cat Behavior","u":3,"d":"Animal & Biomedical Sciences","g":["N"],"at":["Q"],"desc":"This course will provide the student with a basic understanding of species typical companion animal behavior (dogs and cats) and its application and i"},{"c":"ACBS 160D1","n":"Human and Animal Interrelationships","u":3,"d":"Animal & Biomedical Sciences","g":["B"],"at":["W"],"desc":"This course examines the diversity, functions, and nature of human-animal interrelationships over time, geographic region, and world cultures, through"},{"c":"ACCT 230","n":"Analyzing Fraud, Fraudsters, and the Fallout through Film","u":3,"d":"Accountancy, Sch of","g":["B"],"at":["W"],"desc":"This course examines headline-grabbing frauds, the fraudsters behind them, and the resulting regulatory and societal ramifications that have unfolded "},{"c":"AED 210","n":"Resiliency and Human Potential","u":3,"d":"Agricultural Education","g":["B"],"at":["W"],"desc":"The course provides a background in resiliency research to assist learners in acquiring the knowledge and strategies to enhance personal and professio"},{"c":"AED 408","n":"Diversity Issues in a Contemporary Society","u":3,"d":"Agricultural Education","g":["S"],"desc":"This course is designed as a work world preparation course for all majors.  As students ready to leave the relative safety of the cocooned worlds of t"},{"c":"AED 150A1","n":"Learn to Teach to Learn","u":3,"d":"Agricultural Education","g":["S"],"at":["W"],"desc":"This course encourages students to see the world from the educator's perspective to better understand how learning works, the importance of student mo"},{"c":"AED 150C1","n":"Food, Fiber & Natural Resources:  Agriculture and LIfe Sciences Literacy","u":3,"d":"Agricultural Education","g":["B"],"at":["W"],"desc":"Agriculture: So essential yet so misunderstood!  How is agriculture the foundation of our economy and fundamental to our standard of living?  How has "},{"c":"AFAS 200","n":"Introduction to Africana Studies","u":3,"d":"Africana Studies","g":["H"],"desc":"Course provides a comprehensive understanding of the African American experience as grounded in the humanities. A broad investigation of Africana hist","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"AFAS 208","n":"History of Africa","u":3,"d":"History","g":["B"],"at":["C"],"desc":"This course is an introduction to the history of an enormous continent, Africa. Because of the size of the geography, population and time covered, one"},{"c":"AFAS 218","n":"Introduction to Hip-Hop Dance","u":3,"d":"Africana Studies","g":["A"],"desc":"When you think of hip-hop, you often think of gangsters, thugs, pimps, drugs, crime, wealth, violence ,and misogyny. Students taking this course will "},{"c":"AFAS 223","n":"African Philosophical Worlds","u":3,"d":"Africana Studies","g":["H"],"at":["W"],"desc":"Course will introduce students to Black philosophical works from African, African American and Caribbean scholars. This course will outline a genealog"},{"c":"AFAS 245","n":"African Literature Matters","u":3,"d":"French","g":["A"],"at":["C"],"desc":"Introduction to African literature coming from the African continent and the diaspora, which explores the representation of Black experience in a vari"},{"c":"AFAS 249","n":"Images of Africa","u":3,"d":"French","g":["B"],"at":["W","C"],"desc":"This course investigates how audiovisual media including feature films, documentaries, music videos, visual albums represent Africa. The emergence of "},{"c":"AFAS 255","n":"African American Politics","u":3,"d":"Africana Studies","g":["B"],"at":["W"],"desc":"This course focuses on the participation or, lack thereof, of African Americans in the politics and political processes of the United States of Americ"},{"c":"AFAS 260","n":"Ethnic and Race Relations in the United States","u":3,"d":"Sociology, Sch of","g":["S"],"desc":"Analysis of minority relations and mass movements in urban society; trends in the modern world, with special reference to present-day race problems an","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"AFAS 280","n":"Brazilian Identity: Class, Race, and Citizenship","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["W"],"desc":"This course takes representations and experiences of citizenship in modern Brazil as the springboard for the study of cross-cultural membership in soc","p":"2 courses from Tier I - Individuals/Societies."},{"c":"AFAS 285","n":"Conceptualizing Caribbean Society","u":3,"d":"Africana Studies","g":["H"],"at":["C"],"desc":"This course will provide students with an introduction to Caribbean society through an exploration of regional experiences tied to social, cultural an"},{"c":"AFAS 304A","n":"The Social Construction of Race:  Whiteness","u":3,"d":"Africana Studies","g":["H"],"desc":"In constructing this course, the recognition of Whiteness/Blackness is not solely a reactionary response to challenges from persons of color; it is al","p":"Two (2) courses from Tier One - Individuals & Societies."},{"c":"AFAS 310","n":"Afro-Latin American Literature","u":3,"d":"Africana Studies","g":["H"],"desc":"A bio-critical discussion/study of writers of African decent/extraction from Latin America.","p":"Two courses from Tier One, Traditions and Cultures (TRAD 101,102,103,104)."},{"c":"AFAS 314","n":"Caribbean Literature and Culture (West Indies)","u":3,"d":"Africana Studies","g":["H"],"desc":"The course examines how literature captures the multifaceted social, cultural, and political life of the Caribbean region.","p":"Two courses from Tier I - Traditions and Cultures."},{"c":"AFAS 335","n":"Rap, Culture and God","u":3,"d":"Religious Studies, Cmt","g":["B"],"desc":"This course is a study of popular culture and religion in African-American and Latin@ communities, with a focus on the place of rap music in the cultu","p":"Two courses from Tier One, Traditions & Cultures."},{"c":"AFAS 371","n":"Hip-Hop Cinema","u":3,"d":"Africana Studies","g":["B"],"at":["W"],"desc":"This course provides a strong foundation in the history and development of hip-hop cinema from Africana Studies, Cinema and Cultural Studies perspecti"},{"c":"AFAS 373","n":"US & Francophone Hip-Hop Cultures","u":3,"d":"French","g":["A"],"at":["C"],"desc":"Examination of the historical, ethical, social, and political impacts and perspectives of hip-hop artistic practices and works on communities and soci"},{"c":"AFAS 374","n":"Dynamics of Protest in Africa and the Diaspora","u":3,"d":"French","g":["B"],"at":["W","C"],"desc":"This course investigates how the dynamics of resistance and repression have shaped protest in Africa and the diaspora since the slave revolt in Saint-"},{"c":"AFAS 376","n":"Global Soccer","u":3,"d":"Humanities, Col of","g":["S"],"at":["C"],"desc":"While the British invented \\\"football\\\" (as soccer is known around the world), the French were key players in structuring it worldwide. This interdisc","p":"Prerequisite: 2 courses from Tier One Individuals & Societies."},{"c":"AFAS 377","n":"Digital Africana Studies: Experiencing the Harlem Renaissance","u":3,"d":"Africana Studies","g":["H"],"desc":"Dive into the Harlem Renaissance, a whirlwind of African American artistry and intellect in the Roaring Twenties! This electrifying era, sparked in Ha","p":"2 courses from Tier One - Traditions/Cultures."},{"c":"AFAS 386","n":"Soundtrack of the Caribbean","u":3,"d":"Africana Studies","g":["H"],"at":["C"],"desc":"AFAS 386 introduces students to various Caribbean music cultures from the perspective of the French-, Spanish- and English-speaking islands in the Car"},{"c":"AFAS 150B1","n":"Contemporary Afro Brazil","u":3,"d":"Africana Studies","g":["H"],"at":["C"],"desc":"This course challenges historical and contemporary popular culture perceptions of Brazil as a tourist haven and paradise replete with festivities and "},{"c":"AFAS 160A1","n":"Traditions and Societies of the World - The Africana Experience","u":3,"d":"Africana Studies","g":["H"],"at":["C"],"desc":"This course will introduce students to the fundamental issues and concepts in the Africana experience in Africa and the United States from a humanist "},{"c":"AFAS 160D1","n":"Introduction to African American Literature","u":3,"d":"Africana Studies","g":["H"],"desc":"Introduction to African American literature will explore the linguistic and cultural roots and traditions of literary writing by African Americans in "},{"c":"AGTM 170A1","n":"Energy Sources of Arizona and the U.S.","u":3,"d":"Agricultural Education","g":["N"],"at":["Q"],"desc":"We use energy every day. We rely on multiple energy sources to supply our increasing appetite to power our technology, to give us light, and to regula"},{"c":"AIS 210","n":"American Indian Languages","u":3,"d":"Linguistics","g":["B"],"desc":"This course surveys American Indian languages and the communities that speak them, focusing on a representative sample for closer study. The role of l","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"AIS 212","n":"American Indian Religious Traditions","u":3,"d":"Religious Studies, Cmt","g":["H"],"at":["C"],"desc":"This course offers a broad introduction to the diversity and complexity of American Indian religious traditions historically and in the contemporary. ","p":"Two courses from Tier One Traditions/Cultures."},{"c":"AIS 220","n":"Contemporary American Indian Issues","u":3,"d":"American Indian Studies","g":["H"],"at":["W"],"desc":"This course explores a wide variety of current issues relevant to American Indian peoples and Nations in the U.S. Students will explore the historical","p":"2 courses from Tier One Individuals/Societies."},{"c":"AIS 346","n":"Migrations and Landscapes of the Ancient Southwest","u":3,"d":"Anthropology, Sch of","g":["B"],"at":["W","C"],"desc":"People have lived in the Greater Southwest for at least 12,000 years. Because written records on the Southwest began in A.D.1540 with European coloniz"},{"c":"AIS 160A1","n":"Many Nations of Native America","u":3,"d":"American Indian Studies","g":["H"],"at":["W"],"desc":"An interdisciplinary survey of Native peoples in North and Central America, from their origins to present. This course is structured around the themes"},{"c":"AME 170B1","n":"A Century of Flight: How Airplanes have Transformed our World","u":3,"d":"Aerospace & Mechanical Engr","g":["N"],"at":["Q"],"desc":"This course delves into the study of aircraft and other flying vehicles, their impact on global society, and their future evolution toward addressing "},{"c":"ANTH 201","n":"Nonrenewable Resources and World Civilizations","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["B"],"at":["C"],"desc":"The availability and use of metals, petroleum, coal, industrial minerals, and other nonrenewable resources has shaped the history of world societies f","p":" Two courses from Tier One, Natural Sciences."},{"c":"ANTH 220","n":"Contemporary American Indian Issues","u":3,"d":"American Indian Studies","g":["H"],"at":["W"],"desc":"This course explores a wide variety of current issues relevant to American Indian peoples and Nations in the U.S. Students will explore the historical","p":"2 courses from Tier One Individuals/Societies."},{"c":"ANTH 261","n":"Evolutionary Biology and Health in the Human Species","u":3,"d":"Anthropology, Sch of","g":["N"],"at":["W"],"desc":"This course explores a) how our evolutionary history informs us about modern human biology, b) how this history applies to modern health and social pr"},{"c":"ANTH 280","n":"Brazilian Identity: Class, Race, and Citizenship","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["W"],"desc":"This course takes representations and experiences of citizenship in modern Brazil as the springboard for the study of cross-cultural membership in soc","p":"2 courses from Tier I - Individuals/Societies."},{"c":"ANTH 300","n":"The Classical Ideal: From Greece and Rome through the 1930s","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"This is a course that explores the world of ancient Athens and Rome as it was viewed and interpreted in later periods. The learning activities inspire","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"ANTH 316","n":"Sex and Salvation in Latin America","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["W","C"],"desc":"What do witches in colonial Guatemala, nuns in a Mexican convent, born-again gang members in El Salvador, Catholics seeking in-vitro fertilization in "},{"c":"ANTH 317","n":"Latin American Immigration and the Re-making of the U.S.","u":3,"d":"Mexican American Studies","g":["S"],"at":["W"],"desc":"Migration is currently re-shaping American cities, families, urban landscapes, rural areas, politics, and altering the nation's racial and cultural ma","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"ANTH 330","n":"Languages & Societies of the Middle East","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["C"],"desc":"This course introduces the students to the social and linguistic aspects of the languages and cultures of the major Middle Eastern regions, focusing o"},{"c":"ANTH 339","n":"Archaeology of Death","u":3,"d":"Anthropology, Sch of","g":["S"],"at":["W","C"],"desc":"How did ancient peoples dispose of their dead, and why? This course examines the various ways in which archaeologists investigate and interpret the de"},{"c":"ANTH 346","n":"Migrations and Landscapes of the Ancient Southwest","u":3,"d":"Anthropology, Sch of","g":["B"],"at":["W","C"],"desc":"People have lived in the Greater Southwest for at least 12,000 years. Because written records on the Southwest began in A.D.1540 with European coloniz"},{"c":"ANTH 150A1","n":"Race, Racism, and the American Dream","u":3,"d":"Anthropology, Sch of","g":["S"],"at":["W"],"desc":"This course offers a critical analysis of race and racism in the United States through an anthropological lens. We explore everyday experiences of rac"},{"c":"ANTH 150B1","n":"Many Ways of Being Human: Anthropological Perspective","u":3,"d":"Anthropology, Sch of","g":["S"],"at":["C"],"desc":"This course introduces the student to anthropological perspectives on cultural diversity. The course focuses on gender, race, ethnicity and class thro"},{"c":"ANTH 150C1","n":"Humanity: A How to Guide","u":3,"d":"Anthropology, Sch of","g":["B"],"at":["C"],"desc":"Anthropology is the integrative study of who we are and where we come from. Anthropologists study all aspects of human life, including evolution, lang"},{"c":"ANTH 160A1","n":"World Archaeology","u":3,"d":"Anthropology, Sch of","g":["S"],"at":["W","C"],"desc":"Archaeology reveals the human story of curiosity, innovation, exploration, and adaptability preserved in geologic layers around the world. Adaptions t"},{"c":"ANTH 160D2","n":"Origins of Human Diversity","u":3,"d":"Anthropology, Sch of","g":["N"],"at":["W"],"desc":"Our story begins around seven million years ago as the human lineage began to diverge from the great apes. Our story is one of curiosity, innovation, "},{"c":"ANTH 170C1","n":"The Nature of Humans","u":3,"d":"Anthropology, Sch of","g":["N"],"at":["W"],"desc":"In this course students will identify and apply the approaches of a biological anthropologist to investigate a) how our evolutionary history has shape"},{"c":"APAS 205","n":"Asian Pacific American Strategies: Confronting Challenges in the United States","u":3,"d":"Humanities, Col of","g":["B"],"desc":"This course introduces complex challenges that Asian Pacific Americans (APAs) faced throughout their history in the United States and practical steps ","p":"Two courses from Tier One Individuals and Societies."},{"c":"APAS 250","n":"Hidden Histories of Asian Pacific Americans","u":3,"d":"East Asian Studies","g":["H"],"desc":"Asian American Studies is an interdisciplinary field that arose out of the shared concerns of students of Asian and Pacific Islander descent in the Un"},{"c":"APAS 260","n":"Asian Pacific American Cultures in Public Life","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W"],"desc":"From Bruce Lee to Crazy Rich Asians, from General Tso's Chicken to Korean tacos, and from Yuri Kochiyama to Kamala Harris, Asian Pacific American (APA","p":"Two courses from Tier One Traditions and Cultures."},{"c":"APAS 350","n":"Asian American Stereotypes: Data and Bias in a Multicultural Society","u":3,"d":"East Asian Studies","g":["B"],"at":["Q"],"desc":"Stereotypes live in cultures, are remembered in daily experiences, and are sometimes reinforced by popular presentations of data (like social media po"},{"c":"APAS 373","n":"Asian and Asian American Hip Hop Cultures","u":3,"d":"East Asian Studies","g":["A"],"desc":"The art and cultures of hip hop among Asian Americans, Pacific Islanders, and Asians involve a constant dialogue of self and other--with the goal of c"},{"c":"APCV 303","n":"Community Data Fluency for All","u":3,"d":"Applied Science","g":["B"],"at":["W","Q"],"desc":"Data literacy and data presentation are key skills that are prerequisites for data-driven professions.   In this class, students will learn how to und"},{"c":"ARC 220","n":"History of Applied Building Technology","u":3,"d":"Architecture, Sch of","g":["B"],"at":["W"],"desc":"This course provides an overview of global developments in building technology throughout history focusing on the Industrial Revolution to today, expl"},{"c":"ARC 160C1","n":"Architecture and Society","u":3,"d":"Architecture, Sch of","g":["A"],"at":["W","C"],"desc":"The purpose of this course is to lay the foundation for architectural literacy and develop an understanding of architecture's role in society from anc"},{"c":"ARC 160D1","n":"Sonora: A sense of place in arid America","u":3,"d":"Architecture, Sch of","g":["B"],"at":["W","C"],"desc":"This course will provide the student with an entrada(entrance) into the landscape and cultures of the Sonoran Region both in the US and in northern Me"},{"c":"ARE 130","n":"Exploring Art and Visual Culture","u":3,"d":"Art Education, Div","g":["A"],"at":["W"],"desc":"This course focuses on contemporary art and visual culture as a meaningful part of the world in which we live and understanding ourselves within the c"},{"c":"ARE 201","n":"The Arts in Social Movements","u":3,"d":"Art Education, Div","g":["B"],"desc":"This course introduces students to social movements through art and visual culture and to influential works of art and creative action that have helpe","p":"Two courses from Tier One Individuals and Societies."},{"c":"AREC 150E","n":"The Colorado River: Competing for Water in the American West","u":3,"d":"Agricultural & Applied Econ","g":["B"],"at":["Q"],"desc":"Critical analysis of the development of water and land use in the Colorado River watershed including property rights, water management approaches, and"},{"c":"AREC 210","n":"Understanding the World of Commerce","u":3,"d":"Agricultural & Applied Econ","g":["S"],"at":["W"],"desc":"This course provides students with 1) a survey of business organizations as major institutions and the role of individuals as consumers, future entrep","p":"Two courses from Tier One, Individuals and Societies."},{"c":"AREC 217","n":"Economics of Food and Agriculture: Sustainable Solutions for a Changing World","u":3,"d":"Agricultural & Applied Econ","g":["S"],"at":["W","Q"],"desc":"Practical application of economic theory to understand and analyze current issues and events surrounding food, natural resources, the environment, and"},{"c":"AREC 365","n":"The Food Economy - Efficiencies, Gaps and Policies","u":3,"d":"Agricultural & Applied Econ","g":["B"],"at":["Q"],"desc":"Few questions are more fundamental than how we feed the world's people. Yet, the coexistence of food insecurity and food waste begs the question: how ","p":"two courses from Tier One Individuals & Societies"},{"c":"AREC 150C3","n":"Sustaining Life: The Global Economy of Food","u":3,"d":"Agricultural & Applied Econ","g":["B"],"at":["W","C"],"desc":"This course describes the operational fundamentals of the global food system ranging from smaller-scale subsistence or organic production to the large"},{"c":"ARH 201","n":"Survey of Western Art in Society: Prehistory through Gothic","u":3,"d":"Art History","g":["H"],"at":["W"],"desc":"A survey of the art and architecture of western civilization from prehistoric cultures through the Gothic period utilizing interdisciplinary methods. "},{"c":"ARH 202","n":"Survey of Western Art in Society: Renaissance through Modern","u":3,"d":"Art History","g":["A"],"at":["W","C"],"desc":"A survey of the art and architecture of western civilization from the Renaissance through modern times utilizing interdisciplinary methods. The lectur"},{"c":"ARH 203","n":"Survey of Non-Western/Americas Art","u":3,"d":"Art History","g":["H"],"at":["W","C"],"desc":"An interdisciplinary survey of arts and architecture of Africa, Mesoamerica, Native North America, and the Pacific Basin."},{"c":"ARH 300","n":"The Classical Ideal: From Greece and Rome through the 1930s","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"This is a course that explores the world of ancient Athens and Rome as it was viewed and interpreted in later periods. The learning activities inspire","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"ARH 312","n":"Survey of Medieval Art and Architecture","u":3,"d":"Art History","g":["A"],"at":["W"],"desc":"Survey of medieval Christian, Islamic and Jewish art and architecture from the late Roman Empire through the fifteenth century. Religious and secular "},{"c":"ARH 315","n":"Survey of Baroque and Rococo Art","u":3,"d":"Art History","g":["A"],"at":["W"],"desc":"Survey of the major European Monumental painting, printmaking, architecture, and sculpture from 1600 to 1750."},{"c":"ARH 316A","n":"Baroque Art and Culture","u":3,"d":"Art History","g":["H"],"at":["W"],"desc":"A survey of Western Art and Architecture in seventeenth-century Europe. This lecture course will examine the major artists, artistic monuments and mov"},{"c":"ARH 316B","n":"Survey of Eighteenth-Century Art","u":3,"d":"Art History","g":["A"],"at":["W"],"desc":"A survey of European Art and Architecture from the eighteenth-century. The lecture will examine the major artists, artistic monuments and movements of"},{"c":"ARH 318A","n":"Before the Americas: Art of the Aztec, Maya, & Inka","u":3,"d":"Art History","g":["H"],"at":["W","C"],"desc":"The objective is to become familiar with visual art from three broad geographic areas of the ancient New World:  the Central Andes (Peru and Bolivia);"},{"c":"ARH 320","n":"Introduction to European Modern Art","u":3,"d":"Art History","g":["A"],"at":["W"],"desc":"Establishes an understanding of the power of visual images in constructing artistic, gendered, cultural, social, and political identities through stud"},{"c":"ARH 323","n":"Survey of Mexican Art from the 16th - 21st centuries","u":3,"d":"Art History","g":["A"],"at":["W","C"],"desc":"Survey of Mexican art from the 16th - 21st centuries. Course focuses on selected works of art (for example: painting, feather work, photography, mural"},{"c":"ARH 329","n":"Art History of the Cinema","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"This course is based on research and practices about art, film, and popular culture in France, England, Germany, and particularly in America. The lear","p":"Student may only apply the course to one general education requirement."},{"c":"ART 242","n":"Introduction to Photographic Concepts","u":3,"d":"Art","g":["A"],"desc":"In this course, students will examine photographic history, theory, and practice. You will learn to apply the viewpoint of an artist to analyze image-"},{"c":"ART 329","n":"Art History of the Cinema","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"This course is based on research and practices about art, film, and popular culture in France, England, Germany, and particularly in America. The lear","p":"Student may only apply the course to one general education requirement."},{"c":"ART 358","n":"Creative Strategies in Visual Design","u":3,"d":"Art","g":["A"],"at":["W"],"desc":"This course examines issues, principles, methodologies, theories and visual language of graphic design, illustration and new media. Students will be r"},{"c":"ART 360","n":"Visualizing Justice","u":3,"d":"Law","g":["B"],"at":["W"],"desc":"This is a 3-credit, interdisciplinary course that combines legal, art and design concepts to explore: (1) what are legal rights; (2) how do we communi"},{"c":"ART 150A1","n":"Children's Art and Visual Culture","u":3,"d":"Art","g":["A"],"at":["W"],"desc":"In this course, students will explore how and why children make art through observation, discussion, and analysis. Students will determine the signifi"},{"c":"ART 150B1","n":"Engaging Visual Culture","u":3,"d":"Art","g":["B"],"desc":"In this course, we will engage with concepts and practices of visual culture (which includes art) as they relate to our daily lives and to our own pro"},{"c":"ART 150B2","n":"Asian Art and Visual Culture","u":3,"d":"Art","g":["A"],"at":["C"],"desc":"This course will introduce students to Asian art and visual culture, focusing on the art and architecture of South, Southeast, and East Asia. Students"},{"c":"ART 160D1","n":"Art and Society in the Western Tradition","u":3,"d":"Art","g":["A"],"at":["W"],"desc":"Course provides an overview of the relationship between art and western society from the ancient Greek world up to the present, and will address how w"},{"c":"ART 160D2","n":"Design: Culture and Language","u":3,"d":"Art","g":["B"],"at":["Q"],"desc":"This course examines design and surrounding issues, methodologies, theories of visual language and communications. It focuses on the role designers ha"},{"c":"ART 160D3","n":"Museums as Cultural and Community Institutions","u":3,"d":"Art","g":["B"],"at":["W"],"desc":"Museums as Cultural and Community Institutions introduces students to how museums operate internally and externally within their communities by engagi"},{"c":"ASTR 202","n":"Life in the Universe: Are We Alone?","u":3,"d":"Astronomy","g":["B"],"at":["Q"],"desc":"Are we alone in the Universe? This is one of the biggest questions humans can ask, and we confront it head-on in this course. This course is an introd","p":"Two courses from Tier One, Natural Sciences (Catalog numbers 170A, 170B, 170C)."},{"c":"ASTR 206","n":"Exploring Our Solar System","u":3,"d":"Planetary Sciences","g":["N"],"at":["W","Q"],"desc":"Our Solar System is filled with an incredible diversity of objects. These include the sun and planets, of course, but also many hundreds of moons -- s","p":"two courses from Tier One, Natural Sciences (NATS 101, 102, 104)."},{"c":"ASTR 212","n":"Science and Politics of Climate Change","u":3,"d":"Planetary Sciences","g":["B"],"at":["W","Q"],"desc":"This course explores the science of climate change and the political and commercial issues related to global warming. The first part of the course foc"},{"c":"ASTR 214","n":"Life in the Cosmos","u":3,"d":"Planetary Sciences","g":["B"],"at":["Q","C"],"desc":"This course explores key questions in astrobiology and planetary science about the origin and evolution of life on Earth and the possibility that such"},{"c":"ASTR 333","n":"Astronomy and the Arts","u":3,"d":"Astronomy","g":["B"],"at":["W"],"desc":"Course examines astronomical ideas in works of literature, art, and music.  It then contextualizes each work as a bridge between the history of astron"},{"c":"ASTR 170A1","n":"Alien Earths","u":3,"d":"Planetary Sciences","g":["B"],"at":["W","Q"],"desc":"Thousands of planets have been discovered orbiting nearby stars.  How many of these worlds can we expect to be Earth-like?  We explore this question f"},{"c":"ASTR 170B1","n":"Exploring Our Universe","u":3,"d":"Astronomy","g":["N"],"at":["Q"],"desc":"This course tells the story of how astronomers explore our Universe. You will engage in a variety of activities that illustrate historical and contemp"},{"c":"ASTR 170B2","n":"Universe and Humanity: Exploring our Place in Space","u":3,"d":"Planetary Sciences","g":["N"],"at":["W","Q"],"desc":"This course places the Earth and humanity in a broad cosmic context and seeks to answer fundamental questions about our surroundings. Where are we and"},{"c":"ATMO 180","n":"Severe Weather & Climate Change Impacts","u":3,"d":"Hydrology & Atmospheric Sci","g":["B"],"at":["Q"],"desc":"An introduction to the concepts of climate and climate change, and how the combination of weather events and extremes shape a climate. A physical basi"},{"c":"BE 170A1","n":"Water Use and Sustainability","u":3,"d":"Biosystems Engineering","g":["N"],"at":["Q"],"desc":"This fully online course helps students explore the natural science perspective of water use and sustainability. Students will develop an understandin"},{"c":"BE 170A2","n":"Formation of a Planetary Biosystem","u":3,"d":"Biosystems Engineering","g":["N"],"at":["Q"],"desc":"Question: How did our planetary biosystem form, and how common is the formation of biosystems such as our own in the universe? This course describes t"},{"c":"BIOS 216","n":"Understanding Our Health Through Data","u":3,"d":"Epidemiology and Biostatistics","g":["N"],"at":["Q"],"desc":"How can collecting data from our personal lives help us better understand our health?  Can the tools of a natural scientist inform our decisions about"},{"c":"BSM 201","n":"On Being a Healthcare Professional","u":3,"d":"Medicine, College of, Tucson","g":["B"],"desc":"This course offers an overview of our health care system in the larger context of our society. It includes the history of different health care fields"},{"c":"BSM 321","n":"Medical Ethics","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course surveys various ethical issues that arise in relation to medicine and healthcare. Issues covered may include (among others) abortion, assi","p":"2 courses from Tier One - Traditions/Cultures."},{"c":"CE 301","n":"Technical Communications","u":3,"d":"Civil & Arch Engr & Mechanics","g":["B"],"at":["W","Q"],"desc":"Technical Communications is a comprehensive course that provides an overview of written and oral communication, as well as group dynamics. The course "},{"c":"CHEE 204","n":"Water and Energy: Conventional and Alternative Systems","u":3,"d":"Chemical & Environmental Engr","g":["N"],"at":["W","Q"],"desc":"Where does the energy come from to light a building or power an air conditioning system? Where does the water in your facet originate, and what treatm"},{"c":"CHEM 151","n":"Chemical Thinking I","u":4,"d":"Chemistry and Biochemistry","g":["N"],"at":["Q"],"desc":"Integrated lecture-lab course designed to develop a basic understanding of central ways of knowing, thinking, and acting in chemistry that are useful ","p":"Credit is allowed for only one of these lecture/lab combinations: CHEM 105/106A, CHEM 141/143, CHEM "},{"c":"CHEM 152","n":"Chemical Thinking II","u":4,"d":"Chemistry and Biochemistry","g":["N"],"at":["Q"],"desc":"Integrated lecture-lab course designed to develop a basic understanding of central ways of knowing, thinking, and acting in chemistry that are useful ","p":"Credit allowed for only one of the these lecture/lab combinations: CHEM 105B/106B, CHEM 142/144, CHE"},{"c":"CHEM 161","n":"Honors Chemical Thinking I","u":3,"d":"Chemistry and Biochemistry","g":["N"],"at":["Q"],"desc":"This Honors version of Chemical Thinking is designed to help students develop a basic understanding of central ways of knowing, thinking ,and acting i","p":"Credit is allowed for only one of these lecture/lab combinations: CHEM 105A - 106A, CHEM 141-143, CH"},{"c":"CHEM 162","n":"Honors Chemical Thinking II","u":3,"d":"Chemistry and Biochemistry","g":["N"],"at":["Q"],"desc":"This Honors version of Chemical Thinking is designed to help students develop a basic understanding of central ways of knowing, thinking, and acting i","p":"Credit allowed for only one of these lecture/lab combinations: CHEM 105B/106B, CHEM 142/144, CHEM 15"},{"c":"CHN 245","n":"Chinese Popular Culture","u":3,"d":"Chinese","g":["H"],"at":["C"],"desc":"This course introduces four basic aspects of Chinese popular culture: mass media, everyday life, folklore, and arts. It examines how the development o"},{"c":"CHN 345","n":"Buddhists, Bandits, and Beauties: Masterworks of Chinese Fiction from the 1500s to the Digital Age","u":3,"d":"Chinese","g":["B"],"at":["W","C"],"desc":"For centuries, Chinese people have thrilled to the adventures of characters such as the Monkey King, Lord Guan, and Wu Song the tiger killer. All of t"},{"c":"CHN 376A","n":"Contemporary China in Historical Perspective","u":3,"d":"History","g":["B"],"at":["C"],"desc":"The People's Republic of China has emerged as the second largest economy in the world and a major player on the global stage, and that has quickly tur"},{"c":"CHS 202","n":"Connecting Society and Health","u":3,"d":"Sociology, Sch of","g":["B"],"desc":"Why are some people healthier than others? Biology and medicine tell us that some people are biologically or genetically predisposed to be more or les","p":"2 courses from Tier One - Individuals/ Societies."},{"c":"CLAS 224","n":"Love Through the Ages: Conceptions of Love in Ancient Greece, Rome, and Beyond","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"In this course, you will use a humanists perspective to critically examine, analyze, discuss, and formulate arguments about ancient Greek and/or Roman"},{"c":"CLAS 240","n":"Ancient Athletics","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["W","C"],"desc":"This course investigates athletics, sport, and spectacle in ancient Greece and Rome. From the birth of the ancient Olympics in the early days of archa","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"CLAS 260","n":"Ancient Philosophy","u":3,"d":"Philosophy","g":["H"],"at":["W","C"],"desc":"Survey of Greek philosophy, from the pre-Socratic philosophers through Plato and Aristotle to post-Aristotelian philosophers, such as the Stoics, Epic","p":"Two courses from Tier One, Traditions and Cultures (TRAD 101,102,103,104)."},{"c":"CLAS 280","n":"Introduction to the Bible: New Testament","u":3,"d":"Religious Studies, Cmt","g":["H"],"at":["C"],"desc":"This course introduces students to the New Testament in light of the contexts in which it was written and compiled, and as a window into reconstructin","p":"2 courses from Tier One - Traditions/Cultures."},{"c":"CLAS 300","n":"The Classical Ideal: From Greece and Rome through the 1930s","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"This is a course that explores the world of ancient Athens and Rome as it was viewed and interpreted in later periods. The learning activities inspire","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"CLAS 305","n":"Greek and Roman Religion","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["C"],"desc":"Religious beliefs and cult practices in ancient Greece and Rome. All readings in English.","p":"Two courses from Tier One, Individuals and Societies (INDV 101, 102, 103)."},{"c":"CLAS 306","n":"Christianity in the Greco-Roman World","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"This course investigates the emergence of Christianity in the first four centuries of the Greco-Roman milieu. Topics may include: the interaction of e","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"CLAS 315","n":"Seven Wonders of Ancient Greece","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["W","C"],"desc":"This course takes a site-based approach to the history, culture, and archaeology of ancient Greece. Throughout this class, you will journey to seven o"},{"c":"CLAS 323","n":"Ancient Empires","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["W","C"],"desc":"During this class, we will be exploring the diverse nations of the Mediterranean that pursued the acquisition of empire in the ancient world: Pharaoni"},{"c":"CLAS 329","n":"Art History of the Cinema","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"This course is based on research and practices about art, film, and popular culture in France, England, Germany, and particularly in America. The lear","p":"Student may only apply the course to one general education requirement."},{"c":"CLAS 335","n":"The Roman Empire: Rulers and Ruled","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"In this course, we will examine Rome and its Empire from several points of view and across Roman history.  During this semester we will deal with thos"},{"c":"CLAS 342","n":"The Iliad, the Odyssey, and the Epic Tradition","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"CLAS 342 is a General Education Exploring Perspectives (Humanist) course carrying the Writing and World Cultures and Societies attributes. We will bui"},{"c":"CLAS 346","n":"Family Feuds: Re-Interpreting Greek Tragedy","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["W","C"],"desc":"In this course, students will examine ancient Greek tragedy both in its original context, and as it has been interpreted and re-interpreted in more mo"},{"c":"CLAS 352","n":"Pirates, Witches, Barbarians, and True Love: The Ancient Novel","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"The most famous texts you've never heard of, the ancient Greek and Roman novels are a rich and diverse group of texts that arose somewhat suddenly fro","p":"Two courses from Tier One, Traditions & Cultures."},{"c":"CLAS 362","n":"Women and Gender in Antiquity","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["C"],"desc":"In CLAS/GWS 362 we will build a community of inquiry into women and gender in ancient Mediterranean literature, archaeology, and history from the Bron","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"CLAS 363","n":"Race and Classics","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["C"],"desc":"In CLASSICS 363 we will build a community of inquiry examining the intersections of race and Classics. Readings will include primary and secondary sou"},{"c":"CLAS 150C1","n":"Pyramids and Mummies: The Pharaoh and Ancient Egyptian Society","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["W"],"desc":"Pyramids and Mummies focuses on the role of the pharaoh in ancient Egyptian Society and its portrayal in modern culture. It centers on the overarching"},{"c":"CLAS 160B1","n":"Meet the Ancients: Gateway to Greece and Rome","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["W","C"],"desc":"Journey into the past to discover the worlds of the ancient Greeks and Romans. From democracy and republicanism to literature, philosophy and art, the"},{"c":"CLAS 160D2","n":"Classical Mythology: Ancient Stories and What they Tell Us","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"The myths, legends, and folktales of the Greeks, Romans and the peoples of the ancient Near East have remained popular for thousands of years. Togethe"},{"c":"CLAS 160D3","n":"Classical Culture and Society: Critical Concepts from Ancient Greece and Rome","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["C"],"desc":"This course examines different cultural concepts and social realities that prevailed in ancient Greece and Rome and that have persisted in subsequent "},{"c":"CPH 215","n":"Fundamentals of Maternal and Child Health (MCH) Nutrition","u":3,"d":"Public Health, Col of","g":["S"],"at":["W"],"desc":"This course analyzes how public health and nutrition are interrelated including factors that influence the quality of each. This course analyzes basic"},{"c":"CPH 220","n":"Deadly Hype: Finding Truth in the Age of (Mis)Information","u":3,"d":"Community, Environment & Pol","g":["B"],"at":["W","Q"],"desc":"Students will be equipped with critical thinking skills to evaluate media messaging around health-related topics. They will be trained to spot keyword"},{"c":"CPH 230","n":"Public Health, Climate Change and Resilient Food Systems","u":3,"d":"Public Health, Col of","g":["B"],"desc":"In this course, students will build knowledge and develop an understanding of the disparities in food security across rural, peri-urban, and urban are"},{"c":"CPH 315","n":"Sustainable Healthy Diets","u":3,"d":"Public Health, Col of","g":["S"],"at":["W"],"desc":"In this course, students will explore the concept of sustainable healthy diets (SHDs) and examine dietary patterns that promote all dimensions of heal"},{"c":"DATA 101","n":"Data Science: Big Data, AI, and Us","u":3,"d":"Mathematics","g":["B"],"at":["Q"],"desc":"Our world is changing. Data and Artificial Intelligence (AI) are remaking the way we shop, travel, learn, and live.  This course will survey the uses "},{"c":"DATA 201","n":"Foundations of Data Science","u":3,"d":"Mathematics","g":["B"],"at":["Q"],"desc":"According to the Bureau of Labor Statistics, three-quarters of all STEM jobs in the next decade will have a substantial Data Science component in the "},{"c":"DNC 100","n":"Looking at Dance","u":3,"d":"Dance, Sch of","g":["A"],"at":["C"],"desc":"Origins of dance as human expression in ritual, social, and theatrical context. Twentieth century developments in ballet, modern dance, movie, and sho"},{"c":"DNC 101","n":"Dance Appreciation","u":3,"d":"Dance, Sch of","g":["A"],"at":["C"],"desc":"Students will explore dance as a communicative and multicultural art form in society. This course is an introduction to the aesthetic and critical dim"},{"c":"DNC 174","n":"Black Dance in the United States: History, social media, and Other Performances","u":3,"d":"Dance, Sch of","g":["A"],"desc":"This course explores the profound influence of Black dance throughout history, examining the elements, migrations, social dances, and media performanc"},{"c":"DNC 179A","n":"Introduction to Folk Dances from Europe and the Mid East","u":3,"d":"Dance, Sch of","g":["A"],"at":["C"],"desc":"In this course, we will explore folk traditions as they are expressed through dance in Europe and the Middle East and in the descendant traditions in "},{"c":"EAS 201","n":"Myth, Memory, Mind: Introduction to Traditional East Asia","u":3,"d":"East Asian Studies","g":["B"],"at":["C"],"desc":"What would it be like to visit China, Japan, and the Korean Peninsula in premodern times? What is East Asian Studies? This course offers an introducti","p":"Two courses from Tier One, Traditions & Cultures."},{"c":"EAS 202","n":"Symbol, Society, Self: Modern and Contemporary East Asia","u":3,"d":"East Asian Studies","g":["B"],"at":["C"],"desc":"This course offers an interdisciplinary approach to East Asia in modern and contemporary times--its recent histories, evolving cultures, languages, an","p":"Two courses from Tier One, Individuals & Societies."},{"c":"EAS 240","n":"Imagining the Buddha: Images of Buddhism in Asia and the West","u":3,"d":"Religious Studies, Cmt","g":["A"],"at":["C"],"desc":"What does it mean to imagine the Buddha? This course guides students in narrating the lives of Buddhist images by tracing their creation and movement "},{"c":"EAS 250","n":"Hidden Histories of Asian Pacific Americans","u":3,"d":"East Asian Studies","g":["H"],"desc":"Asian American Studies is an interdisciplinary field that arose out of the shared concerns of students of Asian and Pacific Islander descent in the Un"},{"c":"EAS 268","n":"Asian philosophies","u":3,"d":"Philosophy","g":["H"],"at":["W","C"],"desc":"This class will be an introduction to Asian philosophies, including Confucianism, Mohism, Daoism, Buddhism, and Neo-Confucianism. Many schools of thou"},{"c":"EAS 270","n":"War and Revolution in Modern East Asia","u":3,"d":"History","g":["B"],"at":["W","C"],"desc":"This course examines conflict, typically expressing itself in violence and often resulting in wars and revolutions, as defining moments in the modern "},{"c":"EAS 358","n":"Tibetan Buddhism: Liberation, Identity, and Representation","u":3,"d":"Religious Studies, Cmt","g":["H"],"at":["C"],"desc":"How do Tibetans Buddhists innovate while staying connected with tradition? In the Tibetan language, biographies are referred to as liberation tales. I","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"EAS 359","n":"Buddhism and Healing","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["C"],"desc":"Is Buddhism a tradition of healing? In what ways has Buddhism been involved in reviving, sustaining, and curing human individuals? This course explore","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"EAS 150B1","n":"Language, love, life: Study abroad to and from Asia","u":3,"d":"East Asian Studies","g":["B"],"at":["C"],"desc":"This course examines the phenomenon of study abroad as a construct; no study abroad experience is required. East Asia and the rest of the world are no"},{"c":"EAS 160A1","n":"The Worlds of Buddhism","u":3,"d":"East Asian Studies","g":["H"],"at":["W","C"],"desc":"An introduction to Buddhism as both a global religion and an array of cultural traditions, with emphasis on its various forms and development in South"},{"c":"EAS 160A3","n":"Chinese Civilization","u":3,"d":"East Asian Studies","g":["H"],"at":["C"],"desc":"This course offers an introduction to the Chinese civilization from the earliest times to the end of the 18thcentury. It will cover major historical e"},{"c":"EAS 160A5","n":"Languages and Cultures of East Asia","u":3,"d":"East Asian Studies","g":["S"],"at":["W","C"],"desc":"This course will explore the social, historical, and linguistic aspects of the languages and cultures of East Asia and how they have changed over time"},{"c":"ECOL 170C1","n":"Animal Sexual Behavior","u":3,"d":"Ecology & Evolutionary Biology","g":["N"],"at":["Q"],"desc":"This course will examine ideas of how sexual reproduction came about and the consequences the origin of sex has had on biological diversity. We will e"},{"c":"ECOL 170C2","n":"The Diversity of Life","u":3,"d":"Ecology & Evolutionary Biology","g":["N"],"at":["Q"],"desc":"Students will learn the major groups of living organisms (including bacteria, archaeans, protists, fungi, plants, and animals); their basic morphology"},{"c":"ECOL 170C3","n":"Marine Biology","u":3,"d":"Ecology & Evolutionary Biology","g":["N"],"at":["Q"],"desc":"An introduction to life in the ocean and its basic unifying principles, with a major emphasis on the evolution of diverse life forms in the ocean and "},{"c":"ECON 200","n":"Basic Economic Issues","u":3,"d":"Economics","g":["S"],"at":["Q"],"desc":"This course explains how economists see the world. Students learn about basic concepts such as opportunity cost, marginal analysis, supply and demand,","p":"Not available to students who have completed or are enrolled in ECON 201A AND ECON 201B."},{"c":"ECON 205","n":"The Ethics and Economics of Wealth Creation","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"We will study the ethics and the economics of such phenomena as market competition, institutions of private and public property, trade restrictions, g","p":"2 courses from Tier One - Individuals/Societies."},{"c":"ECON 150C2","n":"Climate Science and Economics: How Should Policy Control Warming?","u":3,"d":"Economics","g":["B"],"at":["Q"],"desc":"Introduces the fundamentals of climate change: what is it, what does it mean, and what to do about it.  Describes economic approaches to managing clim"},{"c":"EDP 200","n":"Evolution and Human Development","u":3,"d":"Educational Psychology","g":["S"],"at":["W"],"desc":"An examination of human psychological and behavioral development across the lifespan with a focus on how the processes of evolution have influenced in"},{"c":"EDP 310","n":"Learning Strategies for Youth and Adults","u":3,"d":"Educational Psychology","g":["S"],"at":["W"],"desc":"Learning Strategies for Youth and Adults is an introduction to exploring perspectives of theory, research, and applications of effective and efficient"},{"c":"EDP 150B1","n":"Current Issues in the Psychology of Gender","u":3,"d":"Educational Psychology","g":["S"],"desc":"An in depth exploration of societal and familial influences on gender development along with considerable self-exploration of individual conceptions o"},{"c":"EHS 100","n":"One Health in Action","u":3,"d":"Community, Environment & Pol","g":["N"],"at":["Q"],"desc":"What role do humans, animals, and the environment play in the emergence of pandemics? How can considering the interconnections between humans, animals"},{"c":"EHS 110","n":"Foundations of Disaster Management","u":3,"d":"Community, Environment & Pol","g":["S"],"desc":"In this course, students will explore foundational concepts in disaster risk assessment, management, and response. Through a multidisciplinary approac"},{"c":"EHS 220","n":"Deadly Hype: Finding Truth in the Age of (Mis)Information","u":3,"d":"Community, Environment & Pol","g":["B"],"at":["W","Q"],"desc":"Students will be equipped with critical thinking skills to evaluate media messaging around health-related topics. They will be trained to spot keyword"},{"c":"ENGL 138","n":"Mind-Bending Fiction, Philosophical Worlds","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"This course explores the deep and enduring questions of human existence through the literature and philosophies that have sought to answer them.  Stud"},{"c":"ENGL 162","n":"Anger and Resentment in the Age of Trump: Exploring the Politics of Division and Emotion","u":3,"d":"English","g":["B"],"desc":"This course explores the rise of authoritarian politics in American life through three different disciplinary lenses, including journalism, political "},{"c":"ENGL 178","n":"Dragons, Elves, and How to Build Imaginary Worlds","u":3,"d":"English","g":["A"],"at":["C"],"desc":"If you've ever immersed yourself into Elden Ring or Game of Thrones, you already know that modern fantasy borrows heavily from the European Middle Age"},{"c":"ENGL 201","n":"Introduction to Creative Writing: Creative Nonfiction","u":3,"d":"English","g":["A"],"at":["W"],"desc":"Beginning techniques of creative nonfiction writing taught through exercises, the writing of original nonfiction, workshop and reading in contemporary"},{"c":"ENGL 209","n":"Introduction to Creative Writing: Poetry","u":3,"d":"English","g":["A"],"at":["W"],"desc":"Beginning techniques of poetry writing taught through exercises, the writing of original poetry, workshop and reading in contemporary poetry."},{"c":"ENGL 210","n":"Introduction to Creative Writing: Fiction","u":3,"d":"English","g":["A"],"at":["W"],"desc":"Beginning techniques of fiction writing taught through exercises, the writing of original fiction, workshop and reading in contemporary fiction."},{"c":"ENGL 215","n":"Creative Writing: Elements of Craft","u":3,"d":"English","g":["A"],"at":["W"],"desc":"Multi-genre creative writing course introducing the craft of creative writing (craft elements and aesthetic strategies) via intensive reading as write"},{"c":"ENGL 220A","n":"Reading the Bible: The Old Testament","u":3,"d":"English","g":["B"],"at":["C"],"desc":"Who hasn't heard of the story of Adam and Eve, the Ten Commandments, the tale of David and Goliath, the wisdom of King Solomon, or the \\\"Lord's Prayer"},{"c":"ENGL 220B","n":"Reading the Bible: The New Testament","u":3,"d":"English","g":["B"],"at":["C"],"desc":"The \\\"New Testament\\\" includes some of the most famous stories we have: the crucifixion and resurrection of Jesus, the birth of the ancient Christian ","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D). Complet"},{"c":"ENGL 221","n":"Field Studies in Writing","u":3,"d":"English","g":["A"],"at":["W"],"desc":"In Tucson, we live within the most biodiverse desert in the world, situated at the crux of pressing social, cultural, and environmental issues and opp"},{"c":"ENGL 228","n":"Crossing the Border: Literature and Practice","u":3,"d":"English","g":["H"],"at":["W"],"desc":"This course will integrate the study of border and migration themed literature with a service-learning component, and a final student-directed symposi"},{"c":"ENGL 232","n":"Early Modern Literature: Crossing the Color-Line","u":3,"d":"English","g":["H"],"desc":"This course delves into the themes and conventions shared by English Renaissance and African American literature, highlighting the essential role of h"},{"c":"ENGL 245","n":"African Literature Matters","u":3,"d":"French","g":["A"],"at":["C"],"desc":"Introduction to African literature coming from the African continent and the diaspora, which explores the representation of Black experience in a vari"},{"c":"ENGL 248B","n":"Introduction to Fairy Tales","u":3,"d":"English","g":["A"],"at":["W"],"desc":"Follows fairy tales from their beginnings in storytelling circles into the literary culture and new media.","p":"Completion of freshman composition sequence, and two courses in Tier I Traditions/ Cultures."},{"c":"ENGL 265","n":"Major American Writers","u":3,"d":"English","g":["H"],"at":["W"],"desc":"This class will introduce students to the study of American writers working in English. Through a specialized selection from the many interweaving tra"},{"c":"ENGL 266","n":"Young Adult Literature","u":3,"d":"English","g":["H"],"at":["W"],"desc":"Students will learn to critically examine and write about Young Adult novels and to develop a better understanding of the genre as a whole. Students w"},{"c":"ENGL 269","n":"Video Game Writing","u":3,"d":"English","g":["A"],"at":["W"],"desc":"How do video games affect us when we play them? How do we experience narrative in video games differently than we do in movies or in books? What do vi"},{"c":"ENGL 280","n":"Introduction to Literature","u":3,"d":"English","g":["H"],"at":["W"],"desc":"Stories, poems, plays: literature is the art of putting words together to make meaning. Through literature, humans have explored the deepest human que"},{"c":"ENGL 300","n":"Literature and Film","u":3,"d":"English","g":["H"],"desc":"Comparative study of literature and cinema as aesthetic media. Given the breadth and complexity of film and literature, including historical, technica"},{"c":"ENGL 307","n":"Business Writing","u":3,"d":"English","g":["B"],"at":["W"],"desc":"Business writing is an Engaged Learning course that provides applied, hands-on experiences with professional business writing. The course explores how"},{"c":"ENGL 308","n":"Technical Writing","u":3,"d":"English","g":["B"],"at":["W"],"desc":"Technical Writing is an interdisciplinary professional writing course where students use a rhetorical lens to explore the conventions and practices of"},{"c":"ENGL 322","n":"Can I Have a Word With You? A Linguistic Introduction to English Words","u":3,"d":"Linguistics","g":["S"],"at":["W"],"desc":"An in-depth introduction to the sounds, structures, meanings and history of English words. Why are English alphabet letters pronounced the way they ar"},{"c":"ENGL 331","n":"Diversifying Shakespeare: Engaging Beyond Boundaries","u":3,"d":"English","g":["H"],"desc":"Diversifying Shakespeare: Engaging Beyond Boundaries is a transhistorical, transnational, and transdisciplinary engaged learning course that examines "},{"c":"ENGL 347","n":"English Literature with an Accent: Hearing and Reading Difference","u":3,"d":"English","g":["B"],"desc":"This class explores voice and accent in English literature and cultural production, including podcasts, audiobooks, film, and television. Topics inclu","p":"Two courses from Tier One Individuals & Societies."},{"c":"ENGL 375","n":"Franco-American Relations","u":3,"d":"French","g":["H"],"at":["C"],"desc":"The course's main purpose is to examine Franco-American relations, and more specifically the mutual perspectives on their respective nations offered b"},{"c":"ENGL 377","n":"Digital Africana Studies: Experiencing the Harlem Renaissance","u":3,"d":"Africana Studies","g":["H"],"desc":"Dive into the Harlem Renaissance, a whirlwind of African American artistry and intellect in the Roaring Twenties! This electrifying era, sparked in Ha","p":"2 courses from Tier One - Traditions/Cultures."},{"c":"ENGL 150B2","n":"Social Justice Movements","u":3,"d":"English","g":["B"],"at":["W"],"desc":"This course examines how activists have mobilized social justice movements, including those that have defended the rights of women, immigrants, people"},{"c":"ENGL 160A1","n":"Introduction to Colonial and Postcolonial Literature","u":3,"d":"English","g":["H"],"at":["C"],"desc":"This course offers an introduction to canonical works of colonial and postcolonial literature. Discussed texts will include novels, short stories, ess"},{"c":"ENGL 160A2","n":"Food Writing","u":3,"d":"English","g":["B"],"at":["W"],"desc":"ENGL 160A2 explores food writing and its relationship to culture. Exploring food as both personal and cultural symbol, students will develop an apprec"},{"c":"ENGL 160D2","n":"Nonhuman Subjects: Monsters, Ghosts, Aliens, Others","u":3,"d":"English","g":["H"],"at":["W"],"desc":"Monsters are cool--but they're also interesting, and also sometimes deeply problematic. The category of the \\\"non-human\\\" (or, more broadly, \\\"the Oth"},{"c":"ENGR 422","n":"Perspective of Sustainability: Supplying Mineral Resources for Society","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["B"],"at":["W"],"desc":"Students examine modern sustainable development issues in supplying mineral resources for todays society. Through environmental, societal, and economi"},{"c":"ENTO 165","n":"Edible Insects- The Food Of The Future Is Already Here","u":3,"d":"Entomology","g":["B"],"at":["Q"],"desc":"With the rapid increase in human population, it is becoming harder and harder to produce enough protein to feed everyone. In this course, you will see"},{"c":"ENTO 160D1","n":"Busy Bees and Fancy Fleas: How Insects Shaped Human History","u":3,"d":"Entomology","g":["B"],"at":["W"],"desc":"For as long as humans have been on earth, we have coexisted with arthropods on their planet. Insects account for more than half of all described speci"},{"c":"ENTO 170C2","n":"Secrets of Success: How Insects Conquered Earth!","u":3,"d":"Entomology","g":["N"],"at":["W"],"desc":"Terrestrial arthropods (insects and their relatives, such as spiders, scorpions, millipedes and mites) are the most successful and diverse form of lif"},{"c":"ENVS 175","n":"Nature Disrupted: How Earth Works and How We're Changing It","u":3,"d":"Environmental  Science","g":["N"],"at":["Q"],"desc":"Dive into the wonders of natural systems and learn how organisms, soil, water, and air work together to sustain life on Earth as we know it. Here you'"},{"c":"ENVS 210","n":"Environmental Essentials: A Global Approach to Saving Planet Earth","u":3,"d":"Environmental  Science","g":["B"],"at":["Q","C"],"desc":"We are well on our way to understanding what is needed to get to a carbon neutral more sustainable way of life and address critical and emerging envir"},{"c":"ENVS 226","n":"A Balanced Future: Sustainability & Minerals","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["B"],"at":["Q"],"desc":"This entry-level course examines the interconnected environmental, social, technical, and economic challenges of supplying mineral resources for moder"},{"c":"ENVS 310","n":"Ecosystem Health and Justice","u":3,"d":"Environmental  Science","g":["B"],"at":["Q"],"desc":"Across America, one in four Americans lives within 3 miles of a hazardous waste site (U.S. General Accounting Office, 2013). This means that one's zip","p":"2 courses from Tier One - Individuals/Societies."},{"c":"ENVS 334","n":"Africa in the 22nd Century: Environmental Futures Unfolded","u":3,"d":"Environmental  Science","g":["B"],"at":["Q","C"],"desc":"As the origin of humans and the second largest continent, Africa has natural resource abundance, fast economic growth rates, and a youthful population"},{"c":"ENVS 170A1","n":"Introduction to Environmental Science","u":3,"d":"Environmental  Science","g":["N"],"at":["W","Q"],"desc":"In this course, students will have the opportunity to investigate emerging environmental changes, such as global warming, ozone depletion, the fate of"},{"c":"ESOC 120","n":"Creative Information with AI","u":3,"d":"Information Science","g":["B"],"at":["W"],"desc":"This course explores the basic use of artificial intelligence (AI) tools for creatively producing expressive, academic, and professional information c"},{"c":"ESOC 200","n":"Visual Content Creation for the Information Age","u":3,"d":"Information Science","g":["A"],"at":["W"],"desc":"Visual Content Creation for the Information Age is a dynamic course designed to equip students with the necessary skills to create, share, and critica"},{"c":"ESOC 210","n":"Hacking and Open Source Culture","u":3,"d":"Information Science","g":["S"],"at":["W"],"desc":"The course explores the history, development, and evolution of our digital society by examining the early hackers, geeks, innovators and renegade hipp"},{"c":"ESOC 320","n":"AI Literacies for the Information Age","u":3,"d":"Information Science","g":["B"],"at":["W"],"desc":"This course is a comprehensive exploration of artificial intelligence (AI) tools and approaches across various contexts and disciplines such as inform"},{"c":"ESOC 345","n":"Decoding Deceptive Information","u":3,"d":"Information Science","g":["B"],"at":["W"],"desc":"False and misleading information online threatens our ability to make informed decisions and maintain a shared civic life, but more engaging approache"},{"c":"ESOC 150B1","n":"Social Media and Ourselves","u":3,"d":"Information Science","g":["B"],"at":["W"],"desc":"This course is designed as a gateway to understanding how social media sites influence and are impacted by our selves, as well as the role of social m"},{"c":"EVS 250","n":"Environment and Society in the Southwest Borderlands","u":3,"d":"Geography & Dev, Sch of","g":["S"],"desc":"A Tier Two, Individuals and Societies course explores the broader trends shaping the US Southwest and Borderlands, with particular emphasis on the reg"},{"c":"EVS 260","n":"Environmental Studies: Ideas and Institutions","u":3,"d":"Geography & Dev, Sch of","g":["B"],"desc":"This class analyses the key ideas, individuals, and institutions that have shaped environmental studies and policies in the US and globally. The cours"},{"c":"EVS 150C1","n":"Environment and Society","u":3,"d":"Geography & Dev, Sch of","g":["B"],"desc":"This course introduces students to the study of relationships between people and the environment from a social science perspective, and provides a con"},{"c":"FCM 202","n":"Health, Sex and Legal Boundaries: Disparities in Populations","u":3,"d":"Family & Community Medicine","g":["B"],"at":["W"],"desc":"Sexually active, young and gender minority populations, especially on college campuses, face disproportionate rates of health, safety and legal risks "},{"c":"FCM 305","n":"Mental Health, Mental Illness and Justice","u":3,"d":"Family & Community Medicine","g":["S"],"desc":"Starting with the premises that we enjoy mental health, this course explores issues that emerge when mental health devolves into mental illness, disea"},{"c":"FIN 150C1","n":"Finance and Society: The Good, the Bad, and the Ugly","u":3,"d":"Finance","g":["S"],"desc":"The course objective is to understand the role of finance in society-the good, the bad, and the ugly. The course will focus on four broad topics: Unde"},{"c":"FITS 204","n":"Fashion Consumers and the Shopping Economy","u":3,"d":"Human Ecology, Sch of","g":["S"],"at":["Q"],"desc":"A study of consumer behavior and fashion adoption processes in contemporary society, the nature of fashion theories, the life-cycle, social and cultur"},{"c":"FOOD 101","n":"Introduction to Critical Food Studies","u":3,"d":"Geography & Dev, Sch of","g":["S"],"at":["W"],"desc":"This interdisciplinary course introduces students to a broad range of topics in food studies using a critical social science approach. It focuses on t"},{"c":"FREN 230","n":"Introduction to French Culture","u":3,"d":"French","g":["B"],"at":["C"],"desc":"This gateway course introduces students to French thought and culture through multiple perspectives and disciplines including history, philosophy, law"},{"c":"FREN 231","n":"Fashion and Culture in France and Italy","u":3,"d":"French","g":["B"],"at":["C"],"desc":"The study of fashion is an important conduit for the expression of social identity, political ideas, and aesthetic taste. This course considers the hi"},{"c":"FREN 245","n":"African Literature Matters","u":3,"d":"French","g":["A"],"at":["C"],"desc":"Introduction to African literature coming from the African continent and the diaspora, which explores the representation of Black experience in a vari"},{"c":"FREN 249","n":"Images of Africa","u":3,"d":"French","g":["B"],"at":["W","C"],"desc":"This course investigates how audiovisual media including feature films, documentaries, music videos, visual albums represent Africa. The emergence of "},{"c":"FREN 280","n":"Introduction to French Language, Linguistics and Culture","u":3,"d":"French","g":["H"],"at":["C"],"desc":"Introductory course to key concepts in French language, linguistics and culture through a variety of media (textbook, comics, films, Web). This course","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"FREN 285","n":"Secrets of the Past: Myths, Theater, and Popular Culture (France, USA and the Black Atlantic)","u":3,"d":"French","g":["A"],"at":["C"],"desc":"How do theatre and cinema inform the quest for social justice? Can artistic practices, actors, and products become catalysts for social change? Secret"},{"c":"FREN 300","n":"Pandemics, Politics and Culture in France and Italy","u":3,"d":"French","g":["H"],"at":["W","C"],"desc":"How has humanity responded to and represented pandemics, epidemics and other episodes of contagion in history? What are the roles of race, class and g"},{"c":"FREN 314","n":"Caribbean Literature and Culture (West Indies)","u":3,"d":"Africana Studies","g":["H"],"desc":"The course examines how literature captures the multifaceted social, cultural, and political life of the Caribbean region.","p":"Two courses from Tier I - Traditions and Cultures."},{"c":"FREN 373","n":"US & Francophone Hip-Hop Cultures","u":3,"d":"French","g":["A"],"at":["C"],"desc":"Examination of the historical, ethical, social, and political impacts and perspectives of hip-hop artistic practices and works on communities and soci"},{"c":"FREN 374","n":"Dynamics of Protest in Africa and the Diaspora","u":3,"d":"French","g":["B"],"at":["W","C"],"desc":"This course investigates how the dynamics of resistance and repression have shaped protest in Africa and the diaspora since the slave revolt in Saint-"},{"c":"FREN 375","n":"Franco-American Relations","u":3,"d":"French","g":["H"],"at":["C"],"desc":"The course's main purpose is to examine Franco-American relations, and more specifically the mutual perspectives on their respective nations offered b"},{"c":"FREN 150B1","n":"The Holocaust in France and Italy","u":3,"d":"French","g":["S"],"at":["W"],"desc":"The course examines the origins, development, and implementation of discriminatory racial policies in France and Italy as well as their impact on Jewi"},{"c":"FREN 150C1","n":"Cities, Colonies and Global Networks in the Western Mediterranean","u":3,"d":"French","g":["S"],"at":["W","C"],"desc":"The Mediterranean Sea has been a dynamic crossroad for people, goods, and ideas for thousands of years. Beginning with the medieval commercial revolut"},{"c":"FREN 160A1","n":"The French-Speaking World","u":3,"d":"French","g":["B"],"at":["C"],"desc":"This course will consider the development of the French-speaking world from the colonial period to current times. The first part of the course will pr"},{"c":"FTV 306","n":"Digital Filmmaking: From YouTube to Netflix","u":3,"d":"Theatre, Film & Television,Sch","g":["A"],"desc":"Digital media influences how we perceive the world. Media, including television shows, YouTube, videos, advertisements, and social media, are crafted "},{"c":"FTV 325","n":"German Cinema","u":3,"d":"German Studies","g":["H"],"at":["W"],"desc":"This course provides a historical overview from the 1920s to the present, with a focus on genres and movements such as expressionism, film noir, propa","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"FTV 352","n":"Looking at Movies: Film Styles and Genres","u":3,"d":"Theatre, Film & Television,Sch","g":["A"],"at":["W"],"desc":"Looking at Movies provides an introduction to the history and aesthetics of cinema as a major art form of the 20th century from the perspective of the"},{"c":"FTV 375","n":"Television and U.S. Culture","u":3,"d":"Theatre, Film & Television,Sch","g":["H"],"at":["W"],"desc":"This course explores the connections between television and culture in the United States from the start of the mass audience centered network era of t"},{"c":"FTV 150B1","n":"The Haunted Screen: Understanding the Horror Film","u":3,"d":"Theatre, Film & Television,Sch","g":["A"],"desc":"The horror film is often considered lowbrow and disreputable due to its frequent emphasis on simple shock effects and explicit violence. However, horr"},{"c":"GC 170A1","n":"Introduction to Global Change: Understanding Earth's Environment and Climate Crisis","u":3,"d":"Science Administration","g":["N"],"at":["Q"],"desc":"The basics of physical science are presented within the context of global environmental change processes (climatic change, global warming, deforestati"},{"c":"GEOG 205","n":"Places in the Media","u":3,"d":"Geography & Dev, Sch of","g":["H"],"desc":"This course is an introduction to media and geography. Students will develop critical frames for evaluating how places are represented in media such a"},{"c":"GEOG 210","n":"Political & Cultural Geography of Globalization","u":3,"d":"Geography & Dev, Sch of","g":["S"],"desc":"This course examines how systems of difference provide revealing analytical categories for understanding the political and cultural geography of globa","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"GEOG 220","n":"Our Diverse Biosphere","u":3,"d":"Geography & Dev, Sch of","g":["N"],"at":["Q"],"desc":"The strategy is to immerse non-science majors in the biological aspects of Physical Geography and, through lively debate and discussion, maps and imag","p":"Two courses from Tier One, Natural Sciences (Catalog numbers 170A, 170B, 170C)."},{"c":"GEOG 222","n":"Working with Numeric, Spatial, and Visual Data: Fundamental Geographic Techniques","u":3,"d":"Geography & Dev, Sch of","g":["S"],"at":["Q"],"desc":"Data literacy is essential for navigating today's digitally-mediated world.  In this course, students explore and apply quantitative data to investiga"},{"c":"GEOG 230","n":"Our Changing Climate","u":3,"d":"Geography & Dev, Sch of","g":["N"],"at":["Q"],"desc":"Climate change is among the most important issues of our time. In this course students will learn and apply the perspective of the climate scientist t","p":"Two courses from Tier One, Natural Sciences (Catalog numbers 170A, 170B, 170C)."},{"c":"GEOG 250","n":"Environment and Society in the Southwest Borderlands","u":3,"d":"Geography & Dev, Sch of","g":["S"],"desc":"A Tier Two, Individuals and Societies course explores the broader trends shaping the US Southwest and Borderlands, with particular emphasis on the reg"},{"c":"GEOG 251","n":"World Regions: Comparative and Global Perspectives","u":3,"d":"Geography & Dev, Sch of","g":["S"],"at":["C"],"desc":"Survey and comparison of major world regions with a focus on how global processes, regional interconnections, and local geographic conditions create d"},{"c":"GEOG 256","n":"Sustainable Cities and Societies","u":3,"d":"Planning","g":["B"],"at":["Q"],"desc":"Cities around the globe are working to be more sustainable in response to social, economic and environmental challenges. This course explores thow res"},{"c":"GEOG 338","n":"Biogeography: Where Life Lives","u":3,"d":"Geography & Dev, Sch of","g":["N"],"at":["Q"],"desc":"Biogeography is the study of the spatiotemporal distribution of living things. Biogeographers map and examine the distributions of organisms today and"},{"c":"GEOG 367","n":"Population Geography","u":3,"d":"Geography & Dev, Sch of","g":["S"],"desc":"In this course, students explore the characteristics, geographic distribution, and growth/decline of population at local, regional, national, and glob","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"GEOG 150B2","n":"Crime and the City","u":3,"d":"Geography & Dev, Sch of","g":["S"],"at":["W"],"desc":"In this course, we will discuss social, cultural, political, and geographical issues related to contemporary crime, criminality and criminalization in"},{"c":"GEOG 150C1","n":"Environment and Society","u":3,"d":"Geography & Dev, Sch of","g":["B"],"desc":"This course introduces students to the study of relationships between people and the environment from a social science perspective, and provides a con"},{"c":"GEOG 170A1","n":"Earth Systems Geography","u":3,"d":"Geography & Dev, Sch of","g":["N"],"at":["Q"],"desc":"The course is an introduction to the fundamental physical processes that govern the spatial distribution of Earth's land, sea, air, and biological env"},{"c":"GEOS 201","n":"Nonrenewable Resources and World Civilizations","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["B"],"at":["C"],"desc":"The availability and use of metals, petroleum, coal, industrial minerals, and other nonrenewable resources has shaped the history of world societies f","p":"Two courses from Tier One, Natural Sciences."},{"c":"GEOS 212","n":"Introduction to Oceanography","u":3,"d":"Geosciences","g":["N"],"at":["Q"],"desc":"This course provides an introduction to our amazing Ocean: its shape and depth and how these evolve, the water and what is in it, how the water moves,","p":"Two courses from Tier One, Natural Sciences (Catalog numbers 170A, 170B, 170C)."},{"c":"GEOS 214","n":"Life in the Cosmos","u":3,"d":"Planetary Sciences","g":["B"],"at":["Q","C"],"desc":"This course explores key questions in astrobiology and planetary science about the origin and evolution of life on Earth and the possibility that such"},{"c":"GEOS 216","n":"Dinosaurs: The Real Jurassic Park","u":3,"d":"Geosciences","g":["N"],"at":["Q"],"desc":"The Jurassic Park/Jurassic World franchises opened up the world of dinosaurs to movie audiences worldwide, but how accurate are these movies, did real"},{"c":"GEOS 218","n":"Geological Disasters and Society","u":3,"d":"Geosciences","g":["N"],"at":["Q"],"desc":"Geological disasters (earthquakes, volcanoes, hurricanes, flooding, heat waves, etc.) are potentially life-changing events that are a feature of norma","p":"Two courses from Tier One, Natural Sciences (Catalog numbers 170A, 170B, 170C)."},{"c":"GEOS 220","n":"Environmental History of the Southwest","u":3,"d":"Geosciences","g":["N"],"at":["W","Q"],"desc":"Environmental and cultural history of the Southwest emphasizing discovery of the past using historical science techniques of tree-ring and packrat mid"},{"c":"GEOS 222","n":"The Beauty of Landscapes","u":3,"d":"Geosciences","g":["B"],"at":["W","Q"],"desc":"This course uses landscape art (art portraying landscapes and art made from landscapes) of the Americas as an entrée to exploring the geologic process","p":"Two courses from Tier One, Natural Sciences (Catalog numbers 170A, 170B, 170C)."},{"c":"GEOS 226","n":"A Balanced Future: Sustainability & Minerals","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["B"],"at":["Q"],"desc":"This entry-level course examines the interconnected environmental, social, technical, and economic challenges of supplying mineral resources for moder"},{"c":"GEOS 236","n":"Materials, Societies, & Choices","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["N"],"at":["Q"],"desc":"All human communities consume, produce, recycle, and discard our planet's raw materials. Today's world depends on and interacts with earth materials ("},{"c":"GEOS 170A1","n":"Earth Stories: Interpreting our Dynamic Planet","u":3,"d":"Geosciences","g":["N"],"at":["Q"],"desc":"In this course, students will learn to apply the perspective of the geoscientist to questions about how and when Earth formed, how it has evolved over"},{"c":"GER 114","n":"How to Learn a Foreign Language","u":3,"d":"Linguistics","g":["B"],"at":["W","Q"],"desc":"The goal of the course is to provide students with important tools to help them become successful foreign language learners. Students will become fami"},{"c":"GER 240","n":"Thinkers And Dreamers: Black Pioneers In German And American History","u":3,"d":"German Studies","g":["B"],"desc":"The African diaspora is a concept that deals with the global migration (voluntary and involuntary) of African people throughout history. It addresses "},{"c":"GER 244","n":"Real Talk: Why Language Matters","u":3,"d":"German Studies","g":["S"],"at":["W"],"desc":"In this course, students study conversational talk and its relationship to broader topics like identity, sexism, racism, and linguistic discrimination","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"GER 246","n":"German Culture, Science and Technology","u":3,"d":"German Studies","g":["H"],"at":["W","C"],"desc":"This course explores shifting attitudes towards science, technology, nature, and the environment in the German-speaking world, through a range of cult"},{"c":"GER 273","n":"Wicked Tales and Strange Encounters: German Romanticism and Beyond","u":3,"d":"German Studies","g":["H"],"at":["C"],"desc":"The 19th century introduces us to the strange figures with which we have become fascinated: We only need to turn on the TV to find these same fairy ta","p":"First Year composition, two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 16"},{"c":"GER 276","n":"Crisis, Rebellion and Activism: Germany and Beyond","u":3,"d":"German Studies","g":["H"],"at":["C"],"desc":"What innovations can a moment of extreme crisis bring to a society? From the radicals and reactionaries of Weimar Berlin to the student movements of t"},{"c":"GER 278","n":"Modern Problems - Medieval Answers","u":3,"d":"German Studies","g":["H"],"at":["W"],"desc":"This is a literature, history, and philosophy course dealing with a range of fundamental aspects of human culture in an interdisciplinary fashion, dev"},{"c":"GER 312","n":"War, Death, and the Hero: Medieval Epics: Beowulf, Nibelungenlied, and Rolandslied","u":3,"d":"German Studies","g":["H"],"at":["C"],"desc":"The course addresses pan-European heroic epics, including examples from Old English, Old and Middle High German, Old French, Old Spanish, and Old Icel","p":"Two courses from Tier I - Traditions/Cultures."},{"c":"GER 325","n":"German Cinema","u":3,"d":"German Studies","g":["H"],"at":["W"],"desc":"This course provides a historical overview from the 1920s to the present, with a focus on genres and movements such as expressionism, film noir, propa","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"GER 371","n":"Contemporary German Culture","u":3,"d":"German Studies","g":["H"],"at":["W","C"],"desc":"This course introduces students to topics that shape contemporary Germany. We will examine a broad range of topics addressed in films, literature, pub","p":"Two courses from Tier I Traditions & Cultures."},{"c":"GER 379","n":"Religion in German Culture","u":3,"d":"German Studies","g":["B"],"at":["W","C"],"desc":"Introduction to major cultural figures of German speaking countries who have seen, imagined, or experienced what role religion may or can play in huma","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"GER 150A1","n":"Becoming Multilingual: Learning and Maintaining Two or More Languages","u":3,"d":"German Studies","g":["S"],"at":["W"],"desc":"This course explores the human ability to acquire and maintain two, three, or more languages over a lifetime (i.e., the ability to become multilingual"},{"c":"GER 150B1","n":"Becoming Transcultural: Maximizing Study Abroad","u":3,"d":"German Studies","g":["B"],"at":["C"],"desc":"This course helps students prepare for challenges of intercultural communication during study, work, and travel abroad and in their home country. Usin"},{"c":"GER 160A1","n":"From Animation to Zombies: The Ethics, (Bio)Politics and Aesthetics of Defining Life","u":3,"d":"German Studies","g":["B"],"at":["W"],"desc":"What is life? This course invites you to probe the definitions of one of the most central terms of human existence from A like animation (or animals, "},{"c":"GER 160C1","n":"German Speaking World","u":3,"d":"German Studies","g":["H"],"at":["C"],"desc":"What are the central cultural achievements and trademarks of the German-speaking world? In this course, we will study examples of German-language lite"},{"c":"GER 160D1","n":"Eroticism and Love in the Middle Ages","u":3,"d":"German Studies","g":["B"],"at":["W","C"],"desc":"This course introduces students to the culture and mentality of the Middle Ages, focusing on attitudes toward love, sex, and marriage. Concepts of the"},{"c":"GER 160D2","n":"Gesundheit!: Health and Well-Being in German-Speaking Cultures","u":3,"d":"German Studies","g":["H"],"at":["C"],"desc":"This course brings together perspectives on health and well-being from the humanities, medicine, social sciences, and education to investigate represe"},{"c":"GHI 215","n":"Fundamentals of Maternal and Child Health (MCH) Nutrition","u":3,"d":"Public Health, Col of","g":["S"],"at":["W"],"desc":"This course analyzes how public health and nutrition are interrelated including factors that influence the quality of each. This course analyzes basic"},{"c":"GHI 230","n":"Public Health, Climate Change and Resilient Food Systems","u":3,"d":"Public Health, Col of","g":["B"],"desc":"In this course, students will build knowledge and develop an understanding of the disparities in food security across rural, peri-urban, and urban are"},{"c":"GHI 240","n":"Digital Public Health","u":3,"d":"Public Health, Col of","g":["B"],"at":["W","Q"],"desc":"The \\\"Digital Public Health\\\" course offers an innovative exploration into how digital technologies are reshaping public health. This general educatio"},{"c":"GHI 302","n":"Introduction to Program Evaluation in Global Health","u":3,"d":"Health Promotional Services","g":["S"],"desc":"In this course, students are introduced to the meaning, rationale, context, methods, and applications of program evaluation with a special emphasis on"},{"c":"GHI 315","n":"Sustainable Healthy Diets","u":3,"d":"Public Health, Col of","g":["S"],"at":["W"],"desc":"In this course, students will explore the concept of sustainable healthy diets (SHDs) and examine dietary patterns that promote all dimensions of heal"},{"c":"GLS 200","n":"Introduction to Human Rights","u":3,"d":"Global Studies, Sch of","g":["B"],"desc":"An introduction to human rights, especially through community engagement.  Students will be introduced to the history and theory of human rights as we"},{"c":"GLS 225","n":"Sports and Society in the Middle East and North Africa","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W","C"],"desc":"This course is designed to introduce the social, cultural, economic, and political dimensions of organized sports in the Middle East and North Africa."},{"c":"GLS 230","n":"Latin America: Food and Culture","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["W","C"],"desc":"Food is of wide-ranging interest because it makes up a significant part of the cultures that bind people together into national communities. Food is c"},{"c":"GLS 240","n":"Gender in a Transnational World","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"This interdisciplinary course provides an introduction to concepts of gender as understood in U.S. society, economy, politics, and culture. The course"},{"c":"GLS 245","n":"Islamic Spain in the American Southwest","u":3,"d":"Global Studies, Sch of","g":["S"],"desc":"This course explores the legacies and influences of Islamic (also known as Moorish) Spain in the American Southwest from the sixteenth century to the "},{"c":"GLS 260","n":"Sex, Gender, and Technology","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"This course draws on a variety of texts and media to explore the ways in which sex, gender, and the body are not as \\\"natural\\\" as we generally assume","p":"Two courses from Tier One Individuals/Societies."},{"c":"GLS 277A","n":"History of the Middle East: 600-1453","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"In this course, students take a humanistic disciplinary perspective to explore the cultural products of the pre-modern Middle East and answer question"},{"c":"GLS 277B","n":"A People's History of the Modern Middle East","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["C"],"desc":"This course approaches the history of the modern Middle East through a Humanist perspective. We consider the Ottoman Empire, the Arab lands, and Iran ","p":"MENA 277A is not prerequisite to MENA 277B."},{"c":"GLS 160A1","n":"Global Islam","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"This course provides an overview of the Qur'an, life and teachings of Muhammad, and the differences between Sunni and Shi'i Islam. Students also recei"},{"c":"GLS 160A2","n":"Middle Eastern Humanities","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["C"],"desc":"Middle Eastern Humanities introduces students to the values, traditions, and development of Middle Eastern (largely Islamic and Arab) culture and civi"},{"c":"GLS 160D1","n":"Introduction to Jewish Thought and Culture","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W","C"],"desc":"This course explores Jewish thought and culture, religious ideas and practices through multidisciplinary perspectives including biblical studies and r"},{"c":"GWS 200","n":"Gender, Identity, and Power","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"This course examines how ideas about women, gender, and sexuality have been created through the arts, literature, laws, and science. The course explor","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"GWS 240","n":"Gender in a Transnational World","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"This interdisciplinary course provides an introduction to concepts of gender as understood in U.S. society, economy, politics, and culture. The course"},{"c":"GWS 242","n":"Gender & Education","u":3,"d":"Educ Policy Studies & Practice","g":["B"],"at":["W"],"desc":"Recently, there has been an increasing focus on gender in educational research and practice. Scholars and practitioners are taking note not only of th"},{"c":"GWS 252","n":"Women's Work: Paid & Unpaid, Past & Present","u":3,"d":"History","g":["S"],"desc":"Why should we study women's work?  Is work the key to women's power or to their continuing subordination?  What defines \\\"women's work\\\" and do only w"},{"c":"GWS 260","n":"Sex, Gender, and Technology","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"This course draws on a variety of texts and media to explore the ways in which sex, gender, and the body are not as \\\"natural\\\" as we generally assume","p":"Two courses from Tier One Individuals/Societies."},{"c":"GWS 316","n":"Sex and Salvation in Latin America","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["W","C"],"desc":"What do witches in colonial Guatemala, nuns in a Mexican convent, born-again gang members in El Salvador, Catholics seeking in-vitro fertilization in "},{"c":"GWS 317","n":"Science Fiction Studies","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"Science fiction is studied as a genre of film and print fiction in which we can imagine future societies and future science and technology in utopian ","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"GWS 321","n":"Women in Judaism","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"This course examines religion and gender through the study of women in Judaism. How do scholars construct a history of women in ancient Judaism when J"},{"c":"GWS 328","n":"Women in Russia and Eastern Europe","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["C"],"desc":"This course focuses on the experiences both lived and imagined of women in Russia and Eastern Europe from the nineteenth century to the present day. W","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"GWS 330","n":"Feminist Philosophy","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course explores the ways in which philosophers contributed to the development of feminism, and the ways in which feminist theory is expanding and"},{"c":"GWS 362","n":"Women and Gender in Antiquity","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["C"],"desc":"In CLAS/GWS 362 we will build a community of inquiry into women and gender in ancient Mediterranean literature, archaeology, and history from the Bron","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"GWS 448","n":"Sociology of the Body","u":3,"d":"Sociology, Sch of","g":["S"],"desc":"Too often, human bodies are missing from social scientific and lay models of human behavior and thought.  Sociologists of the Body seek to correct thi"},{"c":"GWS 459","n":"Constructions of Gender","u":3,"d":"Sociology, Sch of","g":["S"],"desc":"This course uses the concept of social construction to analyze how gender organizes our social experiences. It shows how cultural understandings of ge"},{"c":"GWS 150B1","n":"Gender and Contemporary Society","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"Over the past 20 years, we have seen a proliferation of new terms to help keep pace of the shifting meanings of and experimentations with gender: gend"},{"c":"GWS 150B2","n":"Sex, Health and AIDS","u":3,"d":"Global Studies, Sch of","g":["B"],"desc":"Recognizing that HIV/AIDS has irretrievably changed the lives of individuals and societies across the globe, this course sets out to explore this soci"},{"c":"GWS 150B4","n":"LGBTQ Studies","u":3,"d":"Global Studies, Sch of","g":["B"],"desc":"Introduction to the study of sexual identities, communities and politics as they relate to gender, race and class in different cultural contexts.  Spe"},{"c":"GWS 160C1","n":"Technology & Society: Introduction to Science & Technology Studies","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"This course is an introduction to the social, historical, and ethical contexts of knowledge, science and technology. Although science and technology a"},{"c":"HDFS 101","n":"Human Sexuality Across the Lifespan","u":3,"d":"Family Studies and Human Dev","g":["S"],"at":["W"],"desc":"Discover the multifaceted nature of human sexuality as it unfolds throughout our lives. This course examines how sexual values, norms, and behaviors d"},{"c":"HDFS 200","n":"Evolution and Human Development","u":3,"d":"Educational Psychology","g":["S"],"at":["W"],"desc":"An examination of human psychological and behavioral development across the lifespan with a focus on how the processes of evolution have influenced in"},{"c":"HDFS 347","n":"Neuroethics","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course introduces students to neuroethics a burgeoning field in philosophy conducting research in the intersection of neuroscience and ethics. In","p":"Two courses from Tier One, Individuals and Societies (INDV 101, 102, 103)."},{"c":"HDFS 150B1","n":"Men, Fatherhood & Families: Biocultural Perspectives","u":3,"d":"Family Studies and Human Dev","g":["S"],"at":["W"],"desc":"This course examines factors that contribute to variability in men's fatherhood roles, and the effects of fatherhood and fathering roles on men, their"},{"c":"HED 242","n":"Gender & Education","u":3,"d":"Educ Policy Studies & Practice","g":["B"],"at":["W"],"desc":"Recently, there has been an increasing focus on gender in educational research and practice. Scholars and practitioners are taking note not only of th"},{"c":"HED 331","n":"Masculinity, Power, and Education","u":3,"d":"Educ Policy Studies & Practice","g":["S"],"desc":"This course provides a broad-based introduction to masculinity, its social constructions, and how it intersects with race, class, sexual orientation, "},{"c":"HED 350","n":"Student Outreach","u":3,"d":"Educ Policy Studies & Practice","g":["S"],"desc":"This course will introduce students to literature on college access, outreach, academic achievement, and resiliency. Students will learn about inequit","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"HED 397C","n":"Native Student Outreach, Access, and Resiliency","u":3,"d":"Educ Policy Studies & Practice","g":["B"],"at":["C"],"desc":"This service-learning course emphasizes current issues in K-12th grade and college education with a focus on Indigenous (Native American) students. St"},{"c":"HIST 102","n":"Tucson Matters: Making History with Community Museums","u":3,"d":"History","g":["H"],"at":["W"],"desc":"This experiential learning course brings students into the practice of public history through their active involvement in a Tucson community museum co"},{"c":"HIST 111","n":"The History Behind the News: What is the \"Real\" History?","u":3,"d":"History","g":["H"],"at":["W"],"desc":"Every time we remember the past, we are interpreting it.  Studying history helps us learn how to interpret the past responsibly. This course explores "},{"c":"HIST 187","n":"Murder Most Foul: U.S. History through Flashpoint Murder Cases","u":3,"d":"History","g":["H"],"at":["W"],"desc":"What can murder teach us about history? How can we understand high-profile murders from a historical perspective? In this course, we'll examine severa"},{"c":"HIST 203","n":"The Ancient Mediterranean: Power and Identity","u":3,"d":"History","g":["H"],"at":["W","C"],"desc":"This course will focus on the ancient Mediterranean and adjoining regions from 800 BCE to the third century CE of the Roman Empire, emphasizing concep"},{"c":"HIST 207","n":"Games and Play in Medieval and Early Modern European and World History","u":3,"d":"History","g":["H"],"at":["W","C"],"desc":"Games and play are important aspects of all cultures. They provide entertainment and recreation, but they also reflect and influence many other aspect"},{"c":"HIST 208","n":"History of Africa","u":3,"d":"History","g":["B"],"at":["C"],"desc":"This course is an introduction to the history of an enormous continent, Africa. Because of the size of the geography, population and time covered, one"},{"c":"HIST 211","n":"Health and Medicine in Global History","u":3,"d":"History","g":["B"],"at":["W"],"desc":"This course provides a long-term historical perspective on health and medicine in global history. Focusing on both significant historical transformati"},{"c":"HIST 245","n":"The History of Communism through Philosophy, Practice, and Film","u":3,"d":"History","g":["B"],"at":["C"],"desc":"In recent years, there has been a resurgence of movements, organizations, as well as political and intellectual figures that claim to draw inspiration"},{"c":"HIST 246","n":"History of American Capitalism","u":3,"d":"History","g":["B"],"at":["Q"],"desc":"This course provides a long-term historical perspective on the origins and development of American capitalism, combining three interrelated thematic f"},{"c":"HIST 247","n":"Nature and Technology in U. S. History","u":3,"d":"History","g":["B"],"at":["W"],"desc":"This course explores the development of technology and concepts of nature in the United States, from the eighteenth century to the present. It interpr"},{"c":"HIST 252","n":"Women's Work: Paid & Unpaid, Past & Present","u":3,"d":"History","g":["S"],"desc":"Why should we study women's work?  Is work the key to women's power or to their continuing subordination?  What defines \\\"women's work\\\" and do only w"},{"c":"HIST 255","n":"Life in Early Modern Europe","u":3,"d":"History","g":["B"],"at":["W","C"],"desc":"'\tThis course introduces students to Europe in a formative historical period, the early modern age between 1500 and 1800. Encompassing the time betwee"},{"c":"HIST 270","n":"War and Revolution in Modern East Asia","u":3,"d":"History","g":["B"],"at":["W","C"],"desc":"This course examines conflict, typically expressing itself in violence and often resulting in wars and revolutions, as defining moments in the modern "},{"c":"HIST 275","n":"History of Korea through 1945","u":3,"d":"Korean","g":["H"],"at":["C"],"desc":"This survey-level course introduces students to the history of Korea from early times through 1945. From ancient civilization to the end of Japanese c","p":"No prior knowledge of Korea or the Korean language is required."},{"c":"HIST 277A","n":"History of the Middle East: 600-1453","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"In this course, students take a humanistic disciplinary perspective to explore the cultural products of the pre-modern Middle East and answer question"},{"c":"HIST 277B","n":"A People's History of the Modern Middle East","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["C"],"desc":"This course approaches the history of the modern Middle East through a Humanist perspective. We consider the Ottoman Empire, the Arab lands, and Iran ","p":"MENA 277A is not prerequisite to MENA 277B."},{"c":"HIST 278","n":"Modern Problems - Medieval Answers","u":3,"d":"German Studies","g":["H"],"at":["W"],"desc":"This is a literature, history, and philosophy course dealing with a range of fundamental aspects of human culture in an interdisciplinary fashion, dev"},{"c":"HIST 316","n":"Warfare and Violence in History","u":3,"d":"History","g":["H"],"at":["W"],"desc":"From the time of our stone-age ancestors violence has been an integral feature of human societies. Variously expressed as the organized violence of st"},{"c":"HIST 362A","n":"The Culture of Food and Health in Japan","u":3,"d":"Japanese","g":["B"],"at":["W","C"],"desc":"How do we know what is good for us, who gets to decide, and how does \\\"healthy\\\" change over time? This seminar explores these basic questions through"},{"c":"HIST 370B","n":"History of the Jews: Cultural Loss and Resilience from the Middle Ages to the French Revolution","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["C"],"desc":"In this course, we will explore key events and themes in Jewish history from Late Antiquity to the 18th century, with a focus on Jewish life in Europe","p":"2 courses from Tier One - Individuals/Societies."},{"c":"HIST 372A","n":"Interpreting the Bible (Old Testament): Approaches to Understanding Israelite Religion and Society","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"The Hebrew Bible (Old Testament) is one of the most influential and widely studied texts in the world.  For more than two millennia, it has played a c","p":"Two courses from Tier One, Traditions and Cultures (TRAD 101,102,103,104)."},{"c":"HIST 372B","n":"Early Judaism and Christianity: One Book, Two Religions Second Temple Judaism and its Legacy","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"This course surveys scriptures and stories, wisdom texts, histories and apocalyptic visions that Jews living in the Persian and later Greco-Roman worl","p":"Two courses from Tier One, Traditions and Cultures (TRAD 101,102,103,104)."},{"c":"HIST 376A","n":"Contemporary China in Historical Perspective","u":3,"d":"History","g":["B"],"at":["C"],"desc":"The People's Republic of China has emerged as the second largest economy in the world and a major player on the global stage, and that has quickly tur"},{"c":"HIST 377","n":"Modern Israel","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["C"],"desc":"This course surveys the history of the modern state of Israel from the first stirrings of modern Jewish nationalism in the 19th century to the establi"},{"c":"HIST 150C1","n":"Europe in the Modern World","u":3,"d":"History","g":["S"],"at":["C"],"desc":"Europe in the Modern World 1600-1989 presents student with the opportunity to inquire into the origins and development of the modern Western world. Th"},{"c":"HIST 150C2","n":"Modern Latin America","u":3,"d":"History","g":["S"],"at":["C"],"desc":"An interdisciplinary introduction to Latin American societies from the 1820s to the present that gives special emphasis to diversity within Latin Amer"},{"c":"HIST 150C3","n":"U.S. Society and Institutions Since 1877","u":3,"d":"History","g":["S"],"at":["W"],"desc":"This course examines and analyzes the social, political, and economic transformations of American Society since Reconstruction. It focuses on multiple"},{"c":"HIST 150C4","n":"World History: 1600-the Present","u":3,"d":"History","g":["B"],"at":["C"],"desc":"An introduction to concepts and methods from the humanities and social sciences for exploring world history since the trans-Atlantic and trans-Pacific"},{"c":"HIST 160A1","n":"Colonial Latin America","u":3,"d":"History","g":["H"],"at":["C"],"desc":"This course examines 1) the history of Spanish and Portuguese exploration, conquest, settlement, and state-building in the Americas; 2) the impact of "},{"c":"HIST 160A2","n":"Asia and the World","u":3,"d":"History","g":["H"],"at":["W","C"],"desc":"This course explores social, cultural, and political currents in Asia from the fifteenth century to the present. Asia is far too large and diverse to "},{"c":"HIST 160B1","n":"History of Western Civilization: From the Rise of Cities to the Counter Reformation","u":3,"d":"History","g":["H"],"at":["W","C"],"desc":"This course explores the civilizations of the West by considering the development of the ideas and ideologies that shaped the institutions of the West"},{"c":"HIST 160B2","n":"World History to 1600","u":3,"d":"History","g":["B"],"at":["W","C"],"desc":"Survey of topics in world history to 1600."},{"c":"HIST 160C1","n":"The Making of American Cultures, 1600-1877","u":3,"d":"History","g":["H"],"at":["W"],"desc":"This course introduces students to the history of the United States before 1877. It focuses on the creation of a distinctive set of American cultures."},{"c":"HIST 160D1","n":"Food & Power in Global History","u":3,"d":"History","g":["B"],"at":["W","C"],"desc":"Are we really what we eat? Why do certain foods appeal and others repel? How do foods move from their original homes into our own? How has our cuisine"},{"c":"HNRS 203H","n":"Art and Borders","u":3,"d":"Honors, Col","g":["B"],"at":["W","C"],"desc":"Art reflects and shapes how people encounter, and understand, their world. This course takes an expansive view of \\\"art\\\" as a network of interconnect"},{"c":"HNRS 207","n":"LGBT Music and Dance in the U.S.","u":3,"d":"Honors, Col","g":["B"],"desc":"In this course, students trace the emergence of LGBTQ+ music and dance culture in the United States, using theories and methods from queer studies, et"},{"c":"HNRS 208H","n":"Topics in Analytical Thinking and Writing","u":3,"d":"Honors, Col","g":["B"],"at":["W"],"desc":"Students will read and view cultural artifacts in a wide variety of genres, including literature, film, drama, poetry, nonfiction and others.  In-clas"},{"c":"HNRS 209A","n":"Humanities Lab","u":3,"d":"Honors, Col","g":["H"],"at":["W"],"desc":"In this course, students become familiar with research practices and methods of the humanities. Through individual and collaborative research projects"},{"c":"HNRS 209B","n":"Humanities Lab","u":3,"d":"Honors, Col","g":["H"],"at":["W"],"desc":"In this course, students become familiar with research practices and methods of the humanities. Through individual and collaborative research projects"},{"c":"HNRS 210","n":"Art and Anatomies","u":3,"d":"Honors, Col","g":["H"],"at":["W"],"desc":"How does art inform and reflect our understanding of the human body? How do art, philosophy, and science converge during different historical periods "},{"c":"HNRS 211","n":"Work, Meaning, and Well-being","u":3,"d":"Honors, Col","g":["B"],"at":["W"],"desc":"This course combines insights from philosophy and the social sciences to examine how various features of work contribute to (or detract from) a happy,"},{"c":"HNRS 212","n":"Narratives of the Southwest","u":3,"d":"Honors, Col","g":["B"],"at":["W"],"desc":"This interdisciplinary course explores how narratives of the Southwest are created, from historical accounts to folklore, from policy making to art fo"},{"c":"HNRS 216","n":"Living Poetry / The Poet's Life and Work","u":3,"d":"Honors, Col","g":["A"],"at":["W"],"desc":"This Honors course is taught in conjunction with the UA Poetry Center Reading and Lecture Series. Each week we will read works by contemporary poets, "},{"c":"HNRS 218","n":"Communicating Photography: From the Visual to the Verbal","u":3,"d":"Honors, Col","g":["B"],"at":["W"],"desc":"This interdisciplinary course is taught in collaboration with the Center for Creative Photography. Students will learn about the techniques, technolog"},{"c":"HNRS 219","n":"Our Human Footprint","u":3,"d":"Honors, Col","g":["N"],"at":["W","Q"],"desc":"This course addresses the science behind our knowledge of human impact on the planet and how we measure and communicate that impact, with an emphasis ","p":"One or more field trips."},{"c":"HNRS 222","n":"Explorations in Creative Writing","u":3,"d":"Honors, Col","g":["A"],"at":["W"],"desc":"Part critical studies and part writing workshop, this class engages students with creative writing with an emphasis on understanding writing as a craf"},{"c":"HNRS 252","n":"Writing the Body","u":3,"d":"Honors, Col","g":["A"],"at":["W"],"desc":"Close attention to language and storytelling is vital to learning about our relationships and interactions with each other. Our memories and associati"},{"c":"HNRS 295G","n":"Global Diversity and Voices","u":3,"d":"Honors, Col","g":["B"],"at":["C"],"desc":"This course offers a tapestry environment where different undergraduate and professional identities and voices from around the world discuss and inter"},{"c":"HNRS 300","n":"Engendering Music","u":3,"d":"Honors, Col","g":["H"],"at":["C"],"desc":"This course examines socio-cultural interactions between music and gender across a few global case studies. These sequential deep dives will engage hi"},{"c":"HNRS 302","n":"Modern Art and Mental Illness","u":3,"d":"Honors, Col","g":["B"],"at":["W"],"desc":"What does modern art reveal to us about anxiety, addiction, depression, autism, schizophrenia, post-traumatic stress disorder? This course in critical"},{"c":"HNRS 314","n":"Ideas into Action: An Introduction to Civic Engagement","u":3,"d":"Honors, Col","g":["B"],"desc":"This is a dynamic service-learning course where students investigate notions of community and civic engagement through the lens of a social scientist,"},{"c":"HNRS 150B2","n":"Exploring Electronic Presence: From the Telegraph to Twitter and Beyond","u":3,"d":"Honors, Col","g":["B"],"desc":"This course examines communication technologies and the history of electronic communication, and their relationship to the social sphere.   We will ex"},{"c":"HNRS 150C1","n":"Knowledge, Power and Nature","u":3,"d":"Honors, Col","g":["B"],"desc":"This interdisciplinary course facilitates students to critically examine how different factors shape the relationships between human beings and the na","p":"Two Saturday field trips will be a part of the course.  Students will be informed on the first day o"},{"c":"HNRS 160D4","n":"Culture, Place, Identity: Musical Heritage in North America","u":3,"d":"Honors, Col","g":["B"],"at":["W"],"desc":"This course takes a regional approach to sonic heritage by exploring the intersections of ethnicity and place in North American musical cultures. Focu"},{"c":"HNRS 170A1","n":"Sensing Our Environment","u":3,"d":"Honors, Col","g":["B"],"at":["W","Q"],"desc":"This course explores how the culture we grow up in and how/where we live have strong implications for how we see and treat the world. The current domi"},{"c":"HPS 178","n":"Personal Health and Wellness","u":3,"d":"Health Promotional Services","g":["S"],"at":["W"],"desc":"Introduces and analyzes basic personal and community health problems, with emphasis on current scientific information essential to health promotion an"},{"c":"HPS 200","n":"Introduction to Public Health","u":3,"d":"Health Promotional Services","g":["S"],"at":["W"],"desc":"This course provides a broad survey of national, state and local (relevant to Southwest U.S.) community health sciences and services including cultura"},{"c":"HPS 300","n":"Public Health in the 21st Century","u":3,"d":"Health Promotional Services","g":["B"],"at":["Q"],"desc":"This course focuses on emerging and re-emerging causes of morbidity and mortality domestically and globally, and current technologies in public health"},{"c":"HPS 302","n":"Introduction to Program Evaluation in Global Health","u":3,"d":"Health Promotional Services","g":["S"],"desc":"In this course, students are introduced to the meaning, rationale, context, methods, and applications of program evaluation with a special emphasis on"},{"c":"HPS 387","n":"Health Disparities & Minority Health","u":3,"d":"Health Promotional Services","g":["B"],"desc":"The course will explore gaps in health outcomes associated with race/ethnicity, social class, sex, sexuality, nationality and migration status.  Socie"},{"c":"HPS 150C1","n":"Developments in Disease and Public Health","u":3,"d":"Health Promotional Services","g":["B"],"at":["W"],"desc":"In this course, we will examine how infectious diseases like plague, smallpox, tuberculosis, influenza, HIV/AIDS and Covid-19 have shaped geography, p"},{"c":"HRTS 200","n":"Introduction to Human Rights","u":3,"d":"Global Studies, Sch of","g":["B"],"desc":"An introduction to human rights, especially through community engagement.  Students will be introduced to the history and theory of human rights as we"},{"c":"HRTS 250","n":"Current Issues in Human Rights","u":3,"d":"Global Studies, Sch of","g":["S"],"desc":"A comparative and critical inquiry into the historical, theoretical, and social aspects of various human rights abuses currently occurring domesticall"},{"c":"HRTS 300","n":"Human Rights in the U.S.","u":3,"d":"Global Studies, Sch of","g":["B"],"desc":"This class introduces students to human rights in the U.S. context. Throughout the course, we will use interdisciplinary approaches to human rights, w"},{"c":"HRTS 305","n":"Human Rights Stories","u":3,"d":"Global Studies, Sch of","g":["B"],"desc":"This course exposes students to the pivotal roles that stories play in human rights work, including conveying testimonies, education, and marketing hu"},{"c":"HSD 250","n":"Health Equity: Connections, Community & Healing in Urgent Times","u":3,"d":"Nursing","g":["B"],"at":["W"],"desc":"This course will address the most pressing issues challenging people's health through building connections and critically analyzing issues of health i"},{"c":"HSD 401","n":"Design for Health Workshop: Addressing Human Health Challenges with Design Thinking","u":3,"d":"Health Professions, Sch of","g":["B"],"at":["W"],"desc":"In this General Education Building Connections course, you will gain creative confidence and hands-on problem-solving experience. You will work on add"},{"c":"HUMS 205","n":"Asian Pacific American Strategies: Confronting Challenges in the United States","u":3,"d":"Humanities, Col of","g":["B"],"desc":"This course introduces complex challenges that Asian Pacific Americans (APAs) faced throughout their history in the United States and practical steps ","p":"Two courses from Tier One Individuals and Societies."},{"c":"HUMS 376","n":"Global Soccer","u":3,"d":"Humanities, Col of","g":["S"],"at":["C"],"desc":"While the British invented \\\"football\\\" (as soccer is known around the world), the French were key players in structuring it worldwide. This interdisc","p":"Prerequisite: 2 courses from Tier One Individuals & Societies."},{"c":"HUMS 150B1","n":"Mind-Altering Substances in the Ancient World","u":3,"d":"Humanities, Col of","g":["H"],"at":["W","C"],"desc":"This course will be an introduction to the many uses of psychotropic substances in the ancient world. We will explore the different roles that these m"},{"c":"HWRS 236","n":"Materials, Societies, & Choices","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["N"],"at":["Q"],"desc":"All human communities consume, produce, recycle, and discard our planet's raw materials. Today's world depends on and interacts with earth materials ("},{"c":"HWRS 170A1","n":"Earth: Our Watery Home","u":3,"d":"Hydrology & Atmospheric Sci","g":["N"],"at":["W","Q"],"desc":"What makes Earth special?  How have the unique conditions on Earth given rise to life -and how might these conditions change?  We will address these q"},{"c":"IDS 120","n":"Wokeness: Power, Identity, and the Psyche in Contemporary America","u":3,"d":"Humanities, Col of","g":["B"],"desc":"This interdisciplinary course explores issues of power in the United States, with a focus on contemporary debates about \\\"wokeness\\\" in U.S. culture. "},{"c":"ISTA 263","n":"Learning in the Information Age","u":3,"d":"Information Science","g":["B"],"at":["W"],"desc":"Students will examine how the human learning process has been impacted by digital technologies; compare the learning adaptation skills of people from "},{"c":"ISTA 301","n":"Computing and the Arts","u":3,"d":"Information Science","g":["A"],"at":["Q"],"desc":"This course examines the ways in which computing and information science support and facilitate the production and creation of art in current society."},{"c":"ISTA 401","n":"Installation Design","u":3,"d":"Information Science","g":["A"],"at":["Q"],"desc":"This course is a hands-on, project-based approach to understanding and designing art installations. Enrollees will learn principles, tools, and techni","p":"ISTA 301 recommended but not required."},{"c":"ITAL 140","n":"Magic, Religion and Science in Italy","u":3,"d":"Italian","g":["H"],"at":["W","C"],"desc":"This course approaches the study of magic in medieval and Renaissance Italy as a crossroads where different pathways converge.  First, it is a point o"},{"c":"ITAL 230","n":"Introduction to Italian Culture","u":3,"d":"Italian","g":["B"],"at":["W","C"],"desc":"This gateway course introduces students to Italian thought and culture through multiple perspectives and disciplines including history, philosophy. li"},{"c":"ITAL 231","n":"Fashion and Culture in France and Italy","u":3,"d":"French","g":["B"],"at":["C"],"desc":"The study of fashion is an important conduit for the expression of social identity, political ideas, and aesthetic taste. This course considers the hi"},{"c":"ITAL 240","n":"Italian Folklore and Popular Culture","u":3,"d":"Italian","g":["B"],"at":["C"],"desc":"Through multiple interdisciplinary approaches, this course focuses on the dynamics between Italian folklore, or materials that are produced outside of"},{"c":"ITAL 250A","n":"Love, Literature, and Language in the Italian Middle Ages","u":3,"d":"Italian","g":["H"],"at":["C"],"desc":"This course investigates the thirteenth and fourteenth centuries in Italy, a time of great tumult with events such as the 100 Years War, the Avignon P","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"ITAL 250B","n":"The Italian Renaissance","u":3,"d":"Italian","g":["H"],"at":["C"],"desc":"This course investigates the fifteenth and sixteenth centuries in Italy, a time when renewed interest in the Classical past completely altered Western","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"ITAL 250C","n":"Intermediality: Italian Theatre, Opera, and Film","u":3,"d":"Italian","g":["H"],"at":["W","C"],"desc":"How did the Italian historical context and theatrical spaces impact the creation and reception of theatrical texts? How did these texts shape the cont","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"ITAL 250D","n":"Narrating Italy through Literature & Film","u":3,"d":"Italian","g":["B"],"at":["W"],"desc":"This course explores Italian writers, lives and culture through Italian literature and/or film. We will learn about the various historical, socio-cult","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"ITAL 300","n":"Pandemics, Politics and Culture in France and Italy","u":3,"d":"French","g":["H"],"at":["W","C"],"desc":"How has humanity responded to and represented pandemics, epidemics and other episodes of contagion in history? What are the roles of race, class and g"},{"c":"ITAL 330A","n":"Resisting Fascism","u":3,"d":"Italian","g":["A"],"at":["W","C"],"desc":"This course examines how artists dealt with the Italian armed resistance against Fascism particularly during the last two years of World War II, and i"},{"c":"ITAL 330B","n":"Once Upon a Time In Italian American Cinema","u":3,"d":"Italian","g":["A"],"at":["C"],"desc":"What role did cinema play in the encounter between Italian and American culture? How are aesthetic goals such as economy, coherence, and implied perce","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"ITAL 330C","n":"The Good, the Bad, and the Ugly in Italian Cinema","u":3,"d":"Italian","g":["A"],"at":["C"],"desc":"This course will provide an historical introduction to post-war Italian cinema by concentrating on examples of classic genres and movements, such as N"},{"c":"ITAL 330D","n":"Empowered Women in Italian Literature and Culture","u":3,"d":"Italian","g":["H"],"at":["W"],"desc":"Comprehensive study of images of Italian women in literary, historic, religious texts, the visual arts, and their effects on the cultural productions ","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"ITAL 150B1","n":"The Holocaust in France and Italy","u":3,"d":"French","g":["S"],"at":["W"],"desc":"The course examines the origins, development, and implementation of discriminatory racial policies in France and Italy as well as their impact on Jewi"},{"c":"ITAL 150C1","n":"Cities, Colonies and Global Networks in the Western Mediterranean","u":3,"d":"French","g":["S"],"at":["W","C"],"desc":"The Mediterranean Sea has been a dynamic crossroad for people, goods, and ideas for thousands of years. Beginning with the medieval commercial revolut"},{"c":"ITAL 160D1","n":"Food for Thought in Italian Culture","u":3,"d":"Italian","g":["B"],"at":["W","C"],"desc":"Food has always been an important thread woven through the fabric of Italian culture. Italian cuisine, as diverse and heterogeneous as it is inside th"},{"c":"JOUR 305","n":"Full STEM Ahead: Science and the News","u":3,"d":"Journalism, Sch of","g":["B"],"at":["W"],"desc":"\\\"Red wine cures cancer!\\\" \\\"Chocolate causes acne!\\\" \\\"Gum takes seven years to digest!\\\" Scientific research and discovery can make for great headli"},{"c":"JOUR 150C1","n":"News in Society: From the Printing Press to Fake News","u":3,"d":"Journalism, Sch of","g":["B"],"at":["W"],"desc":"From accusations of fake news and biased reporting to sensationalism, trust in media has never been lower. But the importance of quality information s"},{"c":"JPN 220","n":"Nature, Gods, and Zen: Religion in Japanese Society","u":3,"d":"Japanese","g":["B"],"at":["W"],"desc":"This course analyzes the history of religions in Japan and the ways in which \\\"Japanese religion\\\" is portrayed in the contemporary world. In particul","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"JPN 245","n":"Japanese Popular Culture: Manga, Anime, and So Much More!","u":3,"d":"Japanese","g":["A"],"at":["W","C"],"desc":"This course will explore contemporary Japanese society by investigating its colorful, dynamic, and rich output of visual culture. More specifically, w"},{"c":"JPN 311","n":"Death in Traditional Japanese Literature","u":3,"d":"Japanese","g":["H"],"at":["W","C"],"desc":"Everyone dies. Because death and the afterlife are unknowable, people have attempted to imagine, visualize, and write about what comes after life in o"},{"c":"JPN 312","n":"Haunted Japan: Monsters and Wrathful Gods from Ancient Times to the Present","u":3,"d":"Japanese","g":["B"],"at":["C"],"desc":"This course explores the prominent tradition of monsters, wrathful gods, and ghostly phenomena related to religious beliefs, politics, wars, and envir"},{"c":"JPN 362A","n":"The Culture of Food and Health in Japan","u":3,"d":"Japanese","g":["B"],"at":["W","C"],"desc":"How do we know what is good for us, who gets to decide, and how does \\\"healthy\\\" change over time? This seminar explores these basic questions through"},{"c":"JUS 240","n":"Food and Judaism: Global Jewish Foodways from the Ancient World to Modern Culinary Contexts","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["C"],"desc":"This course explores the dynamic intersections between food, religion, and culture within Jewish traditions. Through an interdisciplinary approach, st"},{"c":"JUS 301","n":"Jewish Civilization: A Gateway Course","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"JUS 301 is intended as an introductory survey and as a gateway to more specialized courses in Judaic Studies. The subject of the course is the Jewish "},{"c":"JUS 321","n":"Women in Judaism","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"This course examines religion and gender through the study of women in Judaism. How do scholars construct a history of women in ancient Judaism when J"},{"c":"JUS 325","n":"Jewish Philosophy","u":3,"d":"Philosophy","g":["B"],"at":["W","C"],"desc":"In this course, we will develop an understanding of the variety and unity of Jewish Philosophy through the ages by examining it both as Jewish and as "},{"c":"JUS 332","n":"The Holocaust: Witnesses and Representations","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"This course explores Holocaust memory and representation in Europe, Israel and the United States through various media and genres from diaries, memoir"},{"c":"JUS 370B","n":"History of the Jews: Cultural Loss and Resilience from the Middle Ages to the French Revolution","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["C"],"desc":"In this course, we will explore key events and themes in Jewish history from Late Antiquity to the 18th century, with a focus on Jewish life in Europe","p":"2 courses from Tier One - Individuals/Societies."},{"c":"JUS 372A","n":"Interpreting the Bible (Old Testament): Approaches to Understanding Israelite Religion and Society","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"The Hebrew Bible (Old Testament) is one of the most influential and widely studied texts in the world.  For more than two millennia, it has played a c","p":"Two courses from Tier One, Traditions and Cultures (TRAD 101,102,103,104)."},{"c":"JUS 372B","n":"Early Judaism and Christianity: One Book, Two Religions Second Temple Judaism and its Legacy","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"This course surveys scriptures and stories, wisdom texts, histories and apocalyptic visions that Jews living in the Persian and later Greco-Roman worl","p":"Two courses from Tier One, Traditions and Cultures (TRAD 101,102,103,104)."},{"c":"JUS 377","n":"Modern Israel","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["C"],"desc":"This course surveys the history of the modern state of Israel from the first stirrings of modern Jewish nationalism in the 19th century to the establi"},{"c":"JUS 384","n":"International Human Rights, Transitional Justice, and Israel","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["C"],"desc":"This course will introduce students to international human rights principles and aspects of transitional justice, while also allowing for them to unde"},{"c":"JUS 160D1","n":"Introduction to Jewish Thought and Culture","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W","C"],"desc":"This course explores Jewish thought and culture, religious ideas and practices through multidisciplinary perspectives including biblical studies and r"},{"c":"KOR 245","n":"K-pop, Webtoons, Ethnic Food, and More: Understanding Korean Popular Culture","u":3,"d":"Korean","g":["H"],"at":["C"],"desc":"In this course, we will explore our contemporary world through the lens of popular culture that has saturated our everyday life. In so many ways, we a","p":"Two courses from Tier One, Individuals & Societies."},{"c":"KOR 275","n":"History of Korea through 1945","u":3,"d":"Korean","g":["H"],"at":["C"],"desc":"This survey-level course introduces students to the history of Korea from early times through 1945. From ancient civilization to the end of Japanese c","p":"No prior knowledge of Korea or the Korean language is required."},{"c":"LAR 350","n":"Parks and Urban Public Spaces","u":3,"d":"Landscape Arch & Plan, Sch of","g":["B"],"at":["W"],"desc":"This course exams the history, function, politics and design of parks, gardens and other urban public spaces in American cities.  A typology of public"},{"c":"LAR 150B1","n":"American Design on the Land","u":3,"d":"Landscape Arch & Plan, Sch of","g":["B"],"at":["W"],"desc":"This course is a broad exploration of the built American landscape and how the unique character of American culture continues to shape the land. With "},{"c":"LAS 204","n":"Comparative Politics in the Age of Globalization","u":3,"d":"Govt & Pub Policy, Sch of","g":["S"],"at":["Q","C"],"desc":"Survey of the major political systems and analysis of comparative political concepts, with a view to preparation for more advanced study."},{"c":"LAS 230","n":"Latin America: Food and Culture","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["W","C"],"desc":"Food is of wide-ranging interest because it makes up a significant part of the cultures that bind people together into national communities. Food is c"},{"c":"LAS 251","n":"World Regions: Comparative and Global Perspectives","u":3,"d":"Geography & Dev, Sch of","g":["S"],"at":["C"],"desc":"Survey and comparison of major world regions with a focus on how global processes, regional interconnections, and local geographic conditions create d"},{"c":"LAS 280","n":"Brazilian Identity: Class, Race, and Citizenship","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["W"],"desc":"This course takes representations and experiences of citizenship in modern Brazil as the springboard for the study of cross-cultural membership in soc","p":"2 courses from Tier I - Individuals/Societies."},{"c":"LAS 310","n":"Afro-Latin American Literature","u":3,"d":"Africana Studies","g":["H"],"desc":"A bio-critical discussion/study of writers of African decent/extraction from Latin America.","p":"Two courses from Tier One, Traditions and Cultures (TRAD 101,102,103,104)."},{"c":"LAS 312","n":"Global Power and U.S.-Latin American Relations","u":3,"d":"Global Studies, Sch of","g":["S"],"desc":"How does power shape international relations? In this course, students will apply a social science perspective to the study of U.S.-Latin American rel","p":"Two courses from Tier One, Individuals & Societies."},{"c":"LAS 316","n":"Sex and Salvation in Latin America","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["W","C"],"desc":"What do witches in colonial Guatemala, nuns in a Mexican convent, born-again gang members in El Salvador, Catholics seeking in-vitro fertilization in "},{"c":"LAS 317","n":"Latin American Immigration and the Re-making of the U.S.","u":3,"d":"Mexican American Studies","g":["S"],"at":["W"],"desc":"Migration is currently re-shaping American cities, families, urban landscapes, rural areas, politics, and altering the nation's racial and cultural ma","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"LAS 323","n":"Survey of Mexican Art from the 16th - 21st centuries","u":3,"d":"Art History","g":["A"],"at":["W","C"],"desc":"Survey of Mexican art from the 16th - 21st centuries. Course focuses on selected works of art (for example: painting, feather work, photography, mural"},{"c":"LAS 335","n":"Rap, Culture and God","u":3,"d":"Religious Studies, Cmt","g":["B"],"desc":"This course is a study of popular culture and religion in African-American and Latin@ communities, with a focus on the place of rap music in the cultu","p":"Two courses from Tier One, Traditions & Cultures."},{"c":"LAS 337","n":"Mexican Music and Culture","u":3,"d":"Music, Sch of","g":["A"],"at":["C"],"desc":"This course offers a full panoramic view of Mexican music, using history as a point of departure and linking Mexican music across eras, styles, and pe"},{"c":"LAS 150B1","n":"Modern Latin America: Race, Rights and Revolutions","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["C"],"desc":"In this course, students will apply a social science perspective to the study of Latin America as a complex region. This course will examine the histo"},{"c":"LAS 150B2","n":"Understanding Mexico Today","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["C"],"desc":"Mexico today is a diverse and dynamic country that is often misrepresented in popular stereotypes as a country full of sleepy, rural villages or dange"},{"c":"LAW 360","n":"Visualizing Justice","u":3,"d":"Law","g":["B"],"at":["W"],"desc":"This is a 3-credit, interdisciplinary course that combines legal, art and design concepts to explore: (1) what are legal rights; (2) how do we communi"},{"c":"LING 114","n":"How to Learn a Foreign Language","u":3,"d":"Linguistics","g":["B"],"at":["W","Q"],"desc":"The goal of the course is to provide students with important tools to help them become successful foreign language learners. Students will become fami"},{"c":"LING 210","n":"American Indian Languages","u":3,"d":"Linguistics","g":["B"],"desc":"This course surveys American Indian languages and the communities that speak them, focusing on a representative sample for closer study. The role of l","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"LING 320","n":"Language and Social Issues","u":3,"d":"Linguistics","g":["S"],"at":["W"],"desc":"Focuses on the theme that individuals identify with groups (in part) on the basis of the language or dialect they use. Examines the role of the indivi"},{"c":"LING 322","n":"Can I Have a Word With You? A Linguistic Introduction to English Words","u":3,"d":"Linguistics","g":["S"],"at":["W"],"desc":"An in-depth introduction to the sounds, structures, meanings and history of English words. Why are English alphabet letters pronounced the way they ar"},{"c":"LING 330","n":"Languages & Societies of the Middle East","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["C"],"desc":"This course introduces the students to the social and linguistic aspects of the languages and cultures of the major Middle Eastern regions, focusing o"},{"c":"LING 150A1","n":"Language in the World","u":3,"d":"Linguistics","g":["B"],"at":["W"],"desc":"All human communities have language -and our language is central to our lives. We use language not only to communicate with each other, we use to in o"},{"c":"LING 150C1","n":"Linguistics in the Digital Age","u":3,"d":"Linguistics","g":["B"],"at":["W"],"desc":"Language is increasingly being produced and interpreted by machines and this fact ripples through humans' lives in an increasing variety of linguistic"},{"c":"MAS 265","n":"Culture, Community and Identity","u":3,"d":"Mexican American Studies","g":["H"],"desc":"This course introduces students to Mexican American Studies by examining Mexican American cultural practices, community building, and identity formati"},{"c":"MAS 317","n":"Latin American Immigration and the Re-making of the U.S.","u":3,"d":"Mexican American Studies","g":["S"],"at":["W"],"desc":"Migration is currently re-shaping American cities, families, urban landscapes, rural areas, politics, and altering the nation's racial and cultural ma","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"MAS 337","n":"Mexican Music and Culture","u":3,"d":"Music, Sch of","g":["A"],"at":["C"],"desc":"This course offers a full panoramic view of Mexican music, using history as a point of departure and linking Mexican music across eras, styles, and pe"},{"c":"MAS 365","n":"Latinos and Latinas: Emerging Contemporary Issues","u":3,"d":"Mexican American Studies","g":["S"],"desc":"Using a comparative and interdisciplinary focus this course critically examines major issues affecting today's Latinx populations. Major topics includ"},{"c":"MAS 150B2","n":"Social Justice","u":3,"d":"Mexican American Studies","g":["S"],"desc":"This course focuses on issues of social difference, identity, and social status as these are reflected in scholarship about social justice, and applie"},{"c":"MAS 150C1","n":"Popular Culture, Media, and Latina/o Identities","u":3,"d":"Mexican American Studies","g":["S"],"desc":"In this course, we analyze the experience of Latinx communities through the study of popular culture and media studies. Drawing from interdisciplinary"},{"c":"MCB 181R","n":"Introduction to Molecular and Cellular Biology","u":3,"d":"Molecular & Cellular Biology","g":["N"],"at":["Q"],"desc":"Introduction to Molecular and Cellular Biology covers biological function at the molecular level, with a focus on the structure and regulation of gene"},{"c":"MENA 225","n":"Sports and Society in the Middle East and North Africa","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W","C"],"desc":"This course is designed to introduce the social, cultural, economic, and political dimensions of organized sports in the Middle East and North Africa."},{"c":"MENA 245","n":"Islamic Spain in the American Southwest","u":3,"d":"Global Studies, Sch of","g":["S"],"desc":"This course explores the legacies and influences of Islamic (also known as Moorish) Spain in the American Southwest from the sixteenth century to the "},{"c":"MENA 251","n":"World Regions: Comparative and Global Perspectives","u":3,"d":"Geography & Dev, Sch of","g":["S"],"at":["C"],"desc":"Survey and comparison of major world regions with a focus on how global processes, regional interconnections, and local geographic conditions create d"},{"c":"MENA 277A","n":"History of the Middle East: 600-1453","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"In this course, students take a humanistic disciplinary perspective to explore the cultural products of the pre-modern Middle East and answer question"},{"c":"MENA 277B","n":"A People's History of the Modern Middle East","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["C"],"desc":"This course approaches the history of the modern Middle East through a Humanist perspective. We consider the Ottoman Empire, the Arab lands, and Iran ","p":"MENA 277A is not prerequisite to MENA 277B."},{"c":"MENA 330","n":"Languages & Societies of the Middle East","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["C"],"desc":"This course introduces the students to the social and linguistic aspects of the languages and cultures of the major Middle Eastern regions, focusing o"},{"c":"MENA 334","n":"Islamic Thought","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["C"],"desc":"This course provides an overview of Islamic intellectual history from the origins of Islam to the present day. The course is divided into three units:"},{"c":"MENA 342","n":"The Persian World: Arts, Culture, and History","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W","C"],"desc":"This course introduces students to the Persian world's civilization through engagement with significant historical, political, cultural, and artistic "},{"c":"MENA 372A","n":"Interpreting the Bible (Old Testament): Approaches to Understanding Israelite Religion and Society","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"The Hebrew Bible (Old Testament) is one of the most influential and widely studied texts in the world.  For more than two millennia, it has played a c","p":"Two courses from Tier One, Traditions and Cultures (TRAD 101,102,103,104)."},{"c":"MENA 372B","n":"Early Judaism and Christianity: One Book, Two Religions Second Temple Judaism and its Legacy","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"This course surveys scriptures and stories, wisdom texts, histories and apocalyptic visions that Jews living in the Persian and later Greco-Roman worl","p":"Two courses from Tier One, Traditions and Cultures (TRAD 101,102,103,104)."},{"c":"MENA 377","n":"Modern Israel","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["C"],"desc":"This course surveys the history of the modern state of Israel from the first stirrings of modern Jewish nationalism in the 19th century to the establi"},{"c":"MENA 160A1","n":"Global Islam","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"This course provides an overview of the Qur'an, life and teachings of Muhammad, and the differences between Sunni and Shi'i Islam. Students also recei"},{"c":"MENA 160A2","n":"Middle Eastern Humanities","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["C"],"desc":"Middle Eastern Humanities introduces students to the values, traditions, and development of Middle Eastern (largely Islamic and Arab) culture and civi"},{"c":"MIC 204","n":"Microbes and Society","u":3,"d":"Animal & Biomedical Sciences","g":["B"],"at":["Q"],"desc":"This course explores the impact of microbes on societies at the human-animal-environment interface through the disciplines of natural sciences and soc","p":"Two courses from Tier One, Natural Sciences (Catalog numbers 170A, 170B, 170C)."},{"c":"MIN 226","n":"A Balanced Future: Sustainability & Minerals","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["B"],"at":["Q"],"desc":"This entry-level course examines the interconnected environmental, social, technical, and economic challenges of supplying mineral resources for moder"},{"c":"MIN 236","n":"Materials, Societies, & Choices","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["N"],"at":["Q"],"desc":"All human communities consume, produce, recycle, and discard our planet's raw materials. Today's world depends on and interacts with earth materials ("},{"c":"MIS 150B1","n":"Interpersonal Relationships in a Changing World","u":3,"d":"Management Information Systems","g":["S"],"desc":"Develop an understanding of how we relate to and communicate with others, verbally and non-verbally, individually and in groups, and how communication"},{"c":"MNE 201","n":"Nonrenewable Resources and World Civilizations","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["B"],"at":["C"],"desc":"The availability and use of metals, petroleum, coal, industrial minerals, and other nonrenewable resources has shaped the history of world societies f","p":"Two courses from Tier One, Natural Sciences."},{"c":"MNE 226","n":"A Balanced Future: Sustainability & Minerals","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["B"],"at":["Q"],"desc":"This entry-level course examines the interconnected environmental, social, technical, and economic challenges of supplying mineral resources for moder"},{"c":"MNE 422","n":"Perspective of Sustainability: Supplying Mineral Resources for Society","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["B"],"at":["W"],"desc":"Students examine modern sustainable development issues in supplying mineral resources for todays society. Through environmental, societal, and economi"},{"c":"MSE 220","n":"Making It.....Green:  3D Printing and the Environment","u":3,"d":"Materials Science & Engr","g":["N"],"at":["Q"],"desc":"3-D Printing (also known as Additive Manufacturing (AM)) involves the direct conversion of 3-D computer aided designs into physical objects with appli","p":"Two courses from Tier One, Natural Sciences."},{"c":"MSE 236","n":"Materials, Societies, & Choices","u":3,"d":"Mining Engr & Mineral Res, Sch","g":["N"],"at":["Q"],"desc":"All human communities consume, produce, recycle, and discard our planet's raw materials. Today's world depends on and interacts with earth materials ("},{"c":"MUS 101A","n":"Exploring Music Through the Piano","u":3,"d":"Music, Sch of","g":["A"],"at":["W"],"desc":"This is a beginning general education piano course open to all undergraduate university students, regardless of major. This course explores the creati"},{"c":"MUS 104","n":"Who Cares About Classical Music?","u":3,"d":"Music, Sch of","g":["B"],"at":["W"],"desc":"Today, the history of music is closer than ever. We can listen to music from coffee houses in the 1730s and new compositions that premiered last week "},{"c":"MUS 106","n":"The Beatles: Music and Culture","u":3,"d":"Music, Sch of","g":["A"],"desc":"This course focuses on the life and music of the Beatles within the social and cultural context of the 1960s. Students will learn to apply the perspec"},{"c":"MUS 109","n":"American Popular Music and Society","u":3,"d":"Music, Sch of","g":["A"],"desc":"In this course, students will learn to apply the perspective of diverse musical artists to address questions about how popular music developed in the "},{"c":"MUS 126","n":"Music and Screen Media","u":3,"d":"Music, Sch of","g":["A"],"desc":"This course explores the relationships between music and visual media, including music videos, documentaries, film, television, animation, video games"},{"c":"MUS 231","n":"What is Jazz?","u":3,"d":"Music, Sch of","g":["B"],"desc":"The story of jazz has been told through anecdotes by the audience, music critics, historians, extant recordings, memorabilia, and musicians. Never has"},{"c":"MUS 303","n":"Hip Hop Music Production","u":3,"d":"Music, Sch of","g":["A"],"desc":"Hip Hop Music Production invites students to better understand the ways that hip hop music is produced and made. To do this, students will explore the"},{"c":"MUS 327","n":"Country Music","u":3,"d":"Music, Sch of","g":["A"],"at":["W"],"desc":"What is country music, and how has this answer evolved and been contested over time? This course reflects on country music's unique place in the music"},{"c":"MUS 328","n":"Frank Sinatra, the Voice of an Artist","u":3,"d":"Music, Sch of","g":["A"],"at":["W"],"desc":"Frank Sinatra's ability to interpret songs in performances and recordings earned him space among the most culturally influential figures in America du"},{"c":"MUS 334","n":"Global Sounds","u":3,"d":"Music, Sch of","g":["B"],"at":["C"],"desc":"This course addresses global music-making in case studies from diverse musical traditions. We explore how music and sound are increasingly central to "},{"c":"MUS 335","n":"Musical Communities in North America","u":3,"d":"Music, Sch of","g":["A"],"desc":"This course introduces students to the diverse musical practices cultivated in communities in North America (United States and Canada). We will explor"},{"c":"MUS 337","n":"Mexican Music and Culture","u":3,"d":"Music, Sch of","g":["A"],"at":["C"],"desc":"This course offers a full panoramic view of Mexican music, using history as a point of departure and linking Mexican music across eras, styles, and pe"},{"c":"MUS 360","n":"Learning Music through Guitar and Songwriting","u":3,"d":"Music, Sch of","g":["A"],"at":["W"],"desc":"Music skills, concepts, and information learned through playing, writing, singing, and focused listening. Emphasis on beginning experiences with guita"},{"c":"MUS 160D1","n":"Human Achievement and Innovation in the Arts","u":3,"d":"Music, Sch of","g":["A"],"at":["W"],"desc":"The arts are a defining aspect of what it means to be human. Experiencing important works of visual art, classical music, and dance from around the wo"},{"c":"NAFS 101","n":"Introduction to Critical Food Studies","u":3,"d":"Geography & Dev, Sch of","g":["S"],"at":["W"],"desc":"This interdisciplinary course introduces students to a broad range of topics in food studies using a critical social science approach. It focuses on t"},{"c":"NAFS 365","n":"The Food Economy - Efficiencies, Gaps and Policies","u":3,"d":"Agricultural & Applied Econ","g":["B"],"at":["Q"],"desc":"Few questions are more fundamental than how we feed the world's people. Yet, the coexistence of food insecurity and food waste begs the question: how "},{"c":"NSC 106","n":"MythBusters: Physical Activity and Disease Prevention","u":1,"d":"Nutrl Sci & Wellness, Sch of","g":["B"],"at":["Q"],"desc":"This course provides a comprehensive examination of physical activity and disease prevention through the dual lenses of public health and exercise sci"},{"c":"NSC 310","n":"Human Nutrition in the Prevention and Treatment of Disease","u":3,"d":"Nutrl Sci & Wellness, Sch of","g":["B"],"at":["Q"],"desc":"This course will provide a deeper understanding of the human bodys nutrient requirements, emphasizing the promotion of good health and the primary pre","p":"Tier Two Natural Sciences course requisite: two courses from Tier One Natural Sciences."},{"c":"NSC 353","n":"Fundamentals of Food Science and Safety","u":3,"d":"Nutrl Sci & Wellness, Sch of","g":["B"],"at":["W","Q"],"desc":"Students in this course analyze scientific literature, government documents, written articles, and lay media to assess the truthfulness of information"},{"c":"NSC 365","n":"The Food Economy - Efficiencies, Gaps and Policies","u":3,"d":"Agricultural & Applied Econ","g":["B"],"at":["Q"],"desc":"Few questions are more fundamental than how we feed the world's people. Yet, the coexistence of food insecurity and food waste begs the question: how "},{"c":"NSC 375","n":"Diet, Genes and Disease","u":3,"d":"Nutrl Sci & Wellness, Sch of","g":["N"],"at":["Q"],"desc":"Current knowledge of human nutrition and genes has created a unique opportunity to use diet to improve quality of life through prevention and treatmen"},{"c":"NSC 150C1","n":"Sustainable Nutrition and Food Systems","u":3,"d":"Nutrl Sci & Wellness, Sch of","g":["B"],"desc":"This course provides an introduction to the US food system and examines the relationships between food systems and nutritional science, public health,"},{"c":"NSC 170C1","n":"Nutrition, Food, and You","u":3,"d":"Nutrl Sci & Wellness, Sch of","g":["N"],"at":["Q"],"desc":"Only for students who have not taken NSC 101 (Introduction to Human Nutrition). Nutrition, Food, and You covers the basic principles of human nutritio"},{"c":"NSC 170C2","n":"The Science of Fermentation - When Bad Food Turns Good","u":3,"d":"Nutrl Sci & Wellness, Sch of","g":["N"],"at":["Q"],"desc":"The course introduces students to the fundamentals of fermentation by providing a brief history, and basic processes, outlining the potential health b"},{"c":"NURS 250","n":"Health Equity: Connections, Community & Healing in Urgent Times","u":3,"d":"Nursing","g":["B"],"at":["W"],"desc":"This course will address the most pressing issues challenging people's health through building connections and critically analyzing issues of health i"},{"c":"PA 205","n":"The Ethics and Economics of Wealth Creation","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"We will study the ethics and the economics of such phenomena as market competition, institutions of private and public property, trade restrictions, g","p":"2 courses from Tier One - Individuals/Societies."},{"c":"PA 241","n":"Criminal Justice Administration","u":3,"d":"Govt & Pub Policy, Sch of","g":["S"],"at":["Q"],"desc":"This  course  is  designed  as  a  general  survey  of  the  criminal  justice system in the United States. We begin with a general discussion of the "},{"c":"PA 250","n":"The Social Contract","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course focuses on the idea of the social contract as it has evolved from the seventeenth century to contemporary philosophy. Can government be ju"},{"c":"PA 312","n":"Global Power and U.S.-Latin American Relations","u":3,"d":"Global Studies, Sch of","g":["S"],"desc":"How does power shape international relations? In this course, students will apply a social science perspective to the study of U.S.-Latin American rel","p":"Two courses from Tier One, Individuals & Societies."},{"c":"PA 321","n":"Medical Ethics","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course surveys various ethical issues that arise in relation to medicine and healthcare. Issues covered may include (among others) abortion, assi","p":"2 courses from Tier One - Traditions/Cultures."},{"c":"PA 323","n":"Environmental Ethics","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"We will investigate and seriously consider how and why we should live as morally responsible members of an ecological community. Students will explore","p":"Two courses from Tier One, Individuals and Societies (INDV 101, 102, 103)."},{"c":"PAH 200","n":"Introduction to Applied Humanities","u":3,"d":"Public and Applied Humanities","g":["H"],"at":["W","Q"],"desc":"This courses introduces and helps students to practice a set of critical and practical skills developed specifically for understanding and improving t"},{"c":"PAH 201","n":"Applied Humanities Practice: Techniques and Technologies for Public Enrichment","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W","Q"],"desc":"This course introduces the common techniques and technologies involved in applied humanities work, providing students with the concepts and skills the"},{"c":"PAH 220","n":"Collaboration: A Humanities Perspective","u":3,"d":"Public and Applied Humanities","g":["H"],"at":["W"],"desc":"This course explores how collaborative endeavors are influenced by culture, identity, and diversity. Drawing from the linguistic, cultural, and philos"},{"c":"PAH 221","n":"Creating, Imagining, Innovating: Intercultural Approaches for Academic and Career Success","u":3,"d":"Public and Applied Humanities","g":["H"],"at":["W"],"desc":"The course helps students to engage deeply with the habits of mind and an expanding set of critical and practical applied humanities skills developed "},{"c":"PAH 230","n":"Video Games as Artifacts: Appreciating Interactive Multimedia Entertainment.","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["C"],"desc":"This course introduces students to the techniques and varying contexts of critically appreciating video games. In addition to studying the ways that d"},{"c":"PAH 231","n":"Global Game Cultures and Histories","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W"],"desc":"This course examines the rise and spread of video game cultures from around the world, focusing on the contexts of their origins, proliferation, and ("},{"c":"PAH 240","n":"Some We Love, Some We Hate, Some We Eat: Global Perspectives on Human/Animal Relationships","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W"],"desc":"Human and animal lives have always been intertwined, and animals are omnipresent in human society on both metaphorical and practical, material levels."},{"c":"PAH 260","n":"Asian Pacific American Cultures in Public Life","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W"],"desc":"From Bruce Lee to Crazy Rich Asians, from General Tso's Chicken to Korean tacos, and from Yuri Kochiyama to Kamala Harris, Asian Pacific American (APA","p":"Two courses from Tier One Traditions and Cultures."},{"c":"PAH 310","n":"Urban Multilingualism: An Introduction to Exploring Diverse Cities","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["C"],"desc":"The 21st century is projected to be the century of cities, and it is projected that two-thirds of all people on the planet will live and work in urban","p":"Two courses from Tier One, Individuals & Societies."},{"c":"PAH 320","n":"Work Lives: Identity, Meaning, and Change","u":3,"d":"Public and Applied Humanities","g":["H"],"at":["W"],"desc":"Work - paid, unpaid, voluntary, or obligatory - is woven into the fabric of all human societies to become part of our identities and key to life's nar"},{"c":"PAH 321","n":"Relationship-Based Fundraising: Donor Development in the Nonprofit Sector","u":3,"d":"Public and Applied Humanities","g":["H"],"at":["W"],"desc":"The purpose of this course is to 1) introduce the fundamentals of relationship-based fundraising in the nonprofit sector, and 2) highlight the importa"},{"c":"PAH 330","n":"The Video Game Industry: An Introduction to the Business of Making Money with Play","u":3,"d":"Public and Applied Humanities","g":["H"],"at":["W"],"desc":"This course introduces students to the structures, practices, and study of the video game industry. Over the course of the semester we will: 1) survey"},{"c":"PAH 331","n":"Video Game Studies: Critical/Cultural Approaches","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W"],"desc":"This course surveys the major critical/cultural approaches to the study of video games. Areas of emphasis include industrial analysis, formalism, crit"},{"c":"PAH 332","n":"Tabletop Games: Play, Culture, and Design of Board and Role-Playing Games","u":3,"d":"Public and Applied Humanities","g":["H"],"at":["W"],"desc":"This course explores how tabletop and board games both reflect and influence the cultures they arise from. We begin the course by examining some of th"},{"c":"PAH 350","n":"Health Humanities: Intercultural Perspectives","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W"],"desc":"We are all participants in receiving and interpreting healthcare. This course will encourage and support the development of participants' abilities to","p":"2 courses from Tier One - Individuals/Societies."},{"c":"PAH 372","n":"Intercultural Competence: Culture, Identity, Adaptation, and Intercultural Relations","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W"],"desc":"This course provides students with an in depth discussion of the key concepts and factors that have led to the development of the field of intercultur"},{"c":"PAH 150A1","n":"Video Game Sights, Sounds and Stories","u":3,"d":"Public and Applied Humanities","g":["A"],"at":["W"],"desc":"This course introduces and helps students to practice a set of critical skills developed specifically for understanding the socio-cultural impacts of "},{"c":"PAH 150A2","n":"Weird Stuff: How to Think About the Supernatural, the Paranormal, and the Mysterious","u":3,"d":"Public and Applied Humanities","g":["S"],"at":["W"],"desc":"Few claims seem to arouse more interest, evoke more emotion, and create more confusion than those dealing with the paranormal, the supernatural, or th"},{"c":"PAH 150A3","n":"The Great Outdoors: Improving Health, Wellness, and Creativity by Living Life Outside","u":3,"d":"Public and Applied Humanities","g":["H"],"at":["W"],"desc":"From physicians to neuroscientists to poets and songwriters, people around the world have long written about how even brief immersion in nature can im"},{"c":"PAH 150A4","n":"Wisdom: Investigating and Practicing a Timeless Virtue","u":3,"d":"Public and Applied Humanities","g":["S"],"at":["W"],"desc":"This course investigates wisdom, or the decisions and actions that arise out of knowing what is most important. Drawing from such contexts as educatio"},{"c":"PAH 150A6","n":"Trash to Treasure: Artistic Perspectives on Waste","u":3,"d":"Public and Applied Humanities","g":["A"],"at":["W"],"desc":"In a world grappling with the challenges of overconsumption and environmental degradation, the concept of waste has taken on a profound significance i"},{"c":"PAH 150B1","n":"Motorcycle Culture: Free Spirits, Easy riders, and the Human Experience","u":3,"d":"Public and Applied Humanities","g":["S"],"desc":"The motorcycle is a global icon, an international symbol of a daring, enviable, sometimes even reckless lifestyle of freedom, adventure, and rebellion"},{"c":"PAH 150B2","n":"Car Nation: The Automobile and the American Experience","u":3,"d":"Public and Applied Humanities","g":["H"],"at":["W"],"desc":"Whether Americans drive/ride in a car daily or almost never, they inhabit a nation, landscape, society, culture, and economy which were remade during "},{"c":"PAH 150B3","n":"Secrets: How Humans Hide Things From Each Other","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W"],"desc":"Human beings are secretive creatures, hiding things from one other for pleasure, profit, preservation, and power. Some secrets delight and enrich, oth"},{"c":"PAH 150B4","n":"Friendship: Life's Fundamental Bond","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W"],"desc":"Making and having friends is a central aspect of everyday life in all human societies. Friendship is one of the deepest pleasures of life and has alwa"},{"c":"PAH 150B5","n":"Hunting: Interpretations and Experiences","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W"],"desc":"Hunting is fundamental to the human experience. Throughout history, humans have viewed hunting as a foodway, a lifeway, and even as a sport. This cour"},{"c":"PAH 160D1","n":"Play: An Interactive Introduction","u":3,"d":"Public and Applied Humanities","g":["B"],"desc":"This course introduces students to the study of play, from ancient games of chance to cutting edge playgrounds like amusement parks, escape rooms, and"},{"c":"PAH 160D2","n":"Living the Good Life: Humanities Perspectives on Culture and Community","u":3,"d":"Public and Applied Humanities","g":["H"],"at":["W"],"desc":"This interdisciplinary course analyzes myths and cosmologies that reflect various societal approaches to the grand mysteries of life as represented in"},{"c":"PAH 160D3","n":"Memes: The Art and Craft of Microstorytelling","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W","C"],"desc":"Most everyone is familiar with memes: Gangnam Style music videos, the Success Baby, Rickrolling, Pepe the Frog, and other images, text, and sounds tha"},{"c":"PAH 160D4","n":"Life in the City of Tomorrow: Time Travel, World Building, and Speculative Futures","u":3,"d":"Public and Applied Humanities","g":["H"],"at":["W"],"desc":"This course explores the past, present, and future of urban life by looking at speculative representations of cities. We focus especially on practices"},{"c":"PAH 160D5","n":"Bedtime: Exploring the Cultures and Practices of Sleep","u":3,"d":"Public and Applied Humanities","g":["B"],"at":["W","C"],"desc":"The need for sleep is ubiquitous and part of everyday existence. Like many things that are part of our routine, however,  we rarely take time to consi"},{"c":"PCOL 325","n":"Controversies in Health Care Practice","u":3,"d":"Pharmacology & Toxicology","g":["B"],"at":["W"],"desc":"In this course, students will be exposed to the most controversial and timely topics in healthcare. We will cover lethal injection, euthanasia, pregna"},{"c":"PFFP 302","n":"Personal Finance Management: Money Skills for Financial Success","u":3,"d":"Family and Consumer Sciences","g":["S"],"at":["Q"],"desc":"This course is designed to familiarize students with the fundamental principles and tools used by economic scientists to analyze the personal and fami"},{"c":"PFFP 150B2","n":"Personal Finance Foundations","u":3,"d":"Family and Consumer Sciences","g":["B"],"at":["W","Q"],"desc":"This course describes the prominent characteristics of consumption behavior, societal change that has influenced consumer-driven societies and pressur"},{"c":"PHIL 112","n":"Philosophy at the Movies","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"Introduces students to philosophy through the representation in film of some central philosophical questions. Students view and consider selected film"},{"c":"PHIL 130","n":"Sex, Gender, and Love: An Introduction to Social Philosophy","u":3,"d":"Philosophy","g":["H"],"desc":"What is sex? Is it a mere accident that the English term \\\"sex\\\" refers to both an activity and a system of categorization? How does sex relate to gen"},{"c":"PHIL 138","n":"Mind-Bending Fiction, Philosophical Worlds","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"This course explores the deep and enduring questions of human existence through the literature and philosophies that have sought to answer them.  Stud"},{"c":"PHIL 160","n":"Sciences Vs Pseudoscience: What's the Difference?","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"In this class, we'll work to identify the distinction between science and pseudoscience and determine why the former is a body of genuine knowledge ab"},{"c":"PHIL 205","n":"The Ethics and Economics of Wealth Creation","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"We will study the ethics and the economics of such phenomena as market competition, institutions of private and public property, trade restrictions, g","p":"2 courses from Tier One - Individuals/Societies."},{"c":"PHIL 206","n":"Ethics of Artificial Intelligence","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"This course is an introduction to the ethics of artificial intelligence and automated information systems. The recent development of transformer model"},{"c":"PHIL 210","n":"Moral Thinking","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"It is important \\\"to do the right thing.\\\" But how can anyone tell what \\\"the right thing\\\" is? What makes some actions right and some wrong? This cou","p":"Students declared in the PPEL major are exempt from this enrollment requisite requirement when using"},{"c":"PHIL 213","n":"Contemporary Moral Problems","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"In this course, students will consider a wide range of moral or ethical controversies and positions involved in contemporary life. Topics covered will"},{"c":"PHIL 214","n":"Philosophy of Sport","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course is a comprehensive introduction to philosophical issues in sport: the nature of sports and games, gamesmanship, fair play, e-sports and th"},{"c":"PHIL 220","n":"Philosophy of Happiness","u":3,"d":"Philosophy","g":["H"],"at":["W","C"],"desc":"Happiness matters to us; and now it is in the news. There are large numbers of self-help books telling us how to be happy. Some nations are planning t"},{"c":"PHIL 223","n":"African Philosophical Worlds","u":3,"d":"Africana Studies","g":["H"],"at":["W"],"desc":"Course will introduce students to Black philosophical works from African, African American and Caribbean scholars. This course will outline a genealog"},{"c":"PHIL 233","n":"Philosophy of Religion","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"The United States is, by all accounts, a God-fearing nation: sessions of congress are opened with a prayer, and \\\"In God We Trust\\\" is printed on the ","p":"2 courses from Tier One - Individuals/Societies."},{"c":"PHIL 241","n":"Consciousness and Cognition","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"This course covers some of the central aspects of the philosophical foundations of cognitive science, and ongoing philosophical and scientific debates","p":"2 courses from Tier One - Individuals/Societies."},{"c":"PHIL 246","n":"Existentialism and Phenomenology","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"Suppose it was entirely up to you to decide what is right or wrong, what is valuable and what is not. Suppose it was \\\"entirely\\\" up to you in the sen"},{"c":"PHIL 250","n":"The Social Contract","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course focuses on the idea of the social contract as it has evolved from the seventeenth century to contemporary philosophy. Can government be ju"},{"c":"PHIL 260","n":"Ancient Philosophy","u":3,"d":"Philosophy","g":["H"],"at":["W","C"],"desc":"Survey of Greek philosophy, from the pre-Socratic philosophers through Plato and Aristotle to post-Aristotelian philosophers, such as the Stoics, Epic","p":"Two courses from Tier One, Traditions and Cultures (TRAD 101,102,103,104)."},{"c":"PHIL 261","n":"Survey of Medieval Philosophy","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"The course focuses on three important thinkers in the Christian medieval tradition-Augustine, Anselm, and Aquinas. Topics covered: knowledge and skept","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"PHIL 262","n":"Early Modern Philosophy","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"Survey of major 17th and 18th century British and European philosophers, chosen from Descartes, Spinoza, Leibnitz, Locke, Berkeley, Hume, and Kant.","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"PHIL 263","n":"From Hegel to Nietzsche: 19th Century Philosophy","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"Survey of influential 19th century philosophers, including Hegel, Marx, J. S. Mill, Kierkegaard, and Nietzsche. Their views on the individual and soci"},{"c":"PHIL 265","n":"Twentieth Century Continental Philosophy","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"The twentieth century saw massive changes in sociopolitical organization, technology, and social mores. In this course, students will examine with dif"},{"c":"PHIL 268","n":"Asian philosophies","u":3,"d":"Philosophy","g":["H"],"at":["W","C"],"desc":"This class will be an introduction to Asian philosophies, including Confucianism, Mohism, Daoism, Buddhism, and Neo-Confucianism. Many schools of thou"},{"c":"PHIL 305","n":"Introduction to Philosophy of Science","u":3,"d":"Philosophy","g":["B"],"at":["Q"],"desc":"This course is an introduction to philosophical approaches to scientific methodology. We will cover theories of the scientific method, such as Bayesia","p":"Two courses from Tier One, Natural Sciences (Catalog numbers 170A, 170B, 170C)."},{"c":"PHIL 321","n":"Medical Ethics","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course surveys various ethical issues that arise in relation to medicine and healthcare. Issues covered may include (among others) abortion, assi","p":"2 courses from Tier One - Traditions/Cultures."},{"c":"PHIL 323","n":"Environmental Ethics","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"We will investigate and seriously consider how and why we should live as morally responsible members of an ecological community. Students will explore","p":"Two courses from Tier One, Individuals and Societies (INDV 101, 102, 103)."},{"c":"PHIL 325","n":"Jewish Philosophy","u":3,"d":"Philosophy","g":["B"],"at":["W","C"],"desc":"In this course, we will develop an understanding of the variety and unity of Jewish Philosophy through the ages by examining it both as Jewish and as "},{"c":"PHIL 326","n":"God, Humanity & Science","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["W","C"],"desc":"This course is an examination of the role of religion and science in the construction of human worldviews and beliefs, in historical and contemporary "},{"c":"PHIL 330","n":"Feminist Philosophy","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course explores the ways in which philosophers contributed to the development of feminism, and the ways in which feminist theory is expanding and"},{"c":"PHIL 345","n":"Philosophical perspectives on mental disorder: from anxiety and depression to addiction and delusion","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"In this course, we will be focusing on a variety of issues concerning the existence and nature of mental disorder. These issues are naturally formulat","p":"Two courses from Tier One, Individuals & Societies."},{"c":"PHIL 347","n":"Neuroethics","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course introduces students to neuroethics a burgeoning field in philosophy conducting research in the intersection of neuroscience and ethics. In","p":"Two courses from Tier One, Individuals and Societies (INDV 101, 102, 103)."},{"c":"PHIL 348","n":"The Moral Mind","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"This course is an introduction to the moral mind from the neuroscientific, philosophical and psychological perspective.  Many traditional philosophica","p":"2 courses from Tier One - Individuals/Societies."},{"c":"PHIL 150A1","n":"Free will, Consciousness, and the Meaning of Life","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course examines fundamental questions about our existence and our place in the universe. Questions such as the following will be examined from a "},{"c":"PHIL 150B1","n":"Personal Morality","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"Students will explore the nature of morality in general and examine opposing sides of particular moral debates. Topics may include: abortion, animal r"},{"c":"PHIL 150C1","n":"Freedom, equality, and authority","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"This course examines fundamental questions about the ethical organization of society and social life. These questions include: What is the basis of th"},{"c":"PHIL 160D1","n":"Justice and the good life","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"We all want to live good lives.  To have a good life, in the sense I have in mind, is to be happy, where `happiness' is understood in something like t"},{"c":"PHIL 160D2","n":"Mind, Matter and God","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course introduces students to the philosophical conceptions of mind, matter, and God that have shaped the Western intellectual tradition. Startin"},{"c":"PHP 150C","n":"Aging - Everyone is Doing It!","u":3,"d":"Public Hlth Pract Pol & Transl","g":["S"],"desc":"Aging, everyone is doing it. Yet, how many of us stop to consider the why, what, and how of this process, and whether we can prepare for an optimal ol"},{"c":"PHP 205","n":"Telehealth: It is not just about Clinical Care","u":3,"d":"Public Hlth Pract Pol & Transl","g":["B"],"at":["W"],"desc":"Telehealth is not just about clinical care. This course explores how the fields of business, health, policy and technology are integrated into the del"},{"c":"PHP 222","n":"Quantitative Reasoning in Public Health","u":3,"d":"Public Hlth Pract Pol & Transl","g":["B"],"at":["Q"],"desc":"This course will provide a review of current important public health topics and challenges faced by social scientists tasked with solving these proble"},{"c":"PHP 308","n":"Community Health Education for Disease Outbreaks","u":3,"d":"Public Hlth Pract Pol & Transl","g":["S"],"at":["W"],"desc":"This course focuses on building the foundation for selecting and applying community health education methods, becoming a health education professional"},{"c":"PHPM 225","n":"Introduction to Addiction and Substance Use","u":3,"d":"Public Hlth Pract Pol & Transl","g":["B"],"desc":"This course explores theories of addiction and substances that can be used, misused, and contribute to substance use disorder. It reviews biological, "},{"c":"PHYS 141","n":"Introductory Mechanics","u":4,"d":"Physics","g":["N"],"at":["Q"],"desc":"A first course in Newtonian mechanics; introduces freshman-level students to the statics and dynamics of point particles, rigid bodies, and fluids. To"},{"c":"PHYS 161H","n":"Accelerated Introductory Mechanics","u":4,"d":"Physics","g":["N"],"at":["Q"],"desc":"A freshman-level course in Newtonian mechanics, taught at an accelerated level; introduces freshman-level students to the statics and dynamics of poin"},{"c":"PHYS 200","n":"The Science of Good Cooking","u":3,"d":"Physics","g":["N"],"at":["Q"],"desc":"This course shows students how to cook well using scientific observation, experiment and hypothesis testing.  Lectures introduce the conceptual scienc","p":"Two Tier 1 Natural Science courses."},{"c":"PLG 202","n":"Cities of the Future","u":3,"d":"Planning","g":["B"],"at":["C"],"desc":"This course introduces students to urban planning and the role of cities through the systems that compose the built environment and support urban soci"},{"c":"PLG 211","n":"Equitable Cities: Gender, Sexuality & Race","u":3,"d":"Planning","g":["B"],"at":["W"],"desc":"This course engages planning for equitable cities by engaging the historical and contemporary role of urban planning in shaping our cities' built and "},{"c":"PLG 256","n":"Sustainable Cities and Societies","u":3,"d":"Planning","g":["B"],"at":["Q"],"desc":"Cities around the globe are working to be more sustainable in response to social, economic and environmental challenges. This course explores thow res"},{"c":"PLP 150C1","n":"Mushrooms, Molds, and Man","u":3,"d":"Plant Pathology","g":["N"],"at":["W"],"desc":"This course provides an overview of organisms in the Kingdom Fungi (mushrooms, molds, yeasts, rusts, mildews) and how these organisms impact individua"},{"c":"PLS 307","n":"Origins of Food Plants","u":3,"d":"Plant Sciences, Sch","g":["N"],"at":["Q"],"desc":"In this course, students will learn to apply the perspective of the plant scientist to questions about the deep origins and domestication of modern cr"},{"c":"PLS 170C1","n":"Plants and Our World","u":3,"d":"Plant Sciences, Sch","g":["N"],"at":["Q"],"desc":"This course will introduce students to the principles of plant growth, development, and reproduction from the cellular to the whole organism levels. S"},{"c":"PLS 170C2","n":"Biotechnology and Sustainability","u":3,"d":"Plant Sciences, Sch","g":["N"],"at":["W"],"desc":"To tackle global problems now and in the future, humans need to create innovative and sustainable solutions. Natural scientists practicing modern biot"},{"c":"PLS 170C3","n":"The Challenge of Feeding, Fueling, and Housing 10 Billion People","u":3,"d":"Plant Sciences, Sch","g":["B"],"at":["W"],"desc":"In this course you will explore the challenges associated with feeding, fueling, and housing the current unprecedented number of humans in the face of"},{"c":"POL 202","n":"Introduction to International Relations","u":3,"d":"Govt & Pub Policy, Sch of","g":["S"],"at":["Q"],"desc":"Study of the international system, its actors and their capabilities; ends and means of foreign policy; international tension, conflict, and cooperati","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"POL 203","n":"Political Ideas","u":3,"d":"Govt & Pub Policy, Sch of","g":["H"],"at":["W"],"desc":"Basic issues in political thought, with emphasis on contemporary problems of democracy, liberty, authority, obligation, and ideology.","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"POL 204","n":"Comparative Politics in the Age of Globalization","u":3,"d":"Govt & Pub Policy, Sch of","g":["S"],"at":["Q","C"],"desc":"Survey of the major political systems and analysis of comparative political concepts, with a view to preparation for more advanced study."},{"c":"POL 209","n":"Diversity and Politics in a Changing World","u":3,"d":"Govt & Pub Policy, Sch of","g":["B"],"at":["C"],"desc":"Focus on the politics of diversity and inclusion in a fast-changing world. Attention to national-ethnic, racial, gender, sexual orientation, religious","p":"Two courses from Tier One, Individuals & Societies."},{"c":"POL 250","n":"The Social Contract","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course focuses on the idea of the social contract as it has evolved from the seventeenth century to contemporary philosophy. Can government be ju"},{"c":"POL 312","n":"Global Power and U.S.-Latin American Relations","u":3,"d":"Global Studies, Sch of","g":["S"],"desc":"How does power shape international relations? In this course, students will apply a social science perspective to the study of U.S.-Latin American rel","p":"Two courses from Tier One, Individuals & Societies."},{"c":"POL 377","n":"Modern Israel","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["C"],"desc":"This course surveys the history of the modern state of Israel from the first stirrings of modern Jewish nationalism in the 19th century to the establi"},{"c":"PORT 250","n":"Learning the Power of Storytelling: Creating New Narratives on Climate Change in Brazil and Mexico","u":3,"d":"Portuguese","g":["B"],"desc":"Every time we open the newspaper or watch local, national, or world news, we are invaded by a plethora of narratives on climate change. This course se"},{"c":"PORT 280","n":"Brazilian Identity: Class, Race, and Citizenship","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["W"],"desc":"This course takes representations and experiences of citizenship in modern Brazil as the springboard for the study of cross-cultural membership in soc","p":"2 courses from Tier I - Individuals/Societies."},{"c":"PPEL 205","n":"The Ethics and Economics of Wealth Creation","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"We will study the ethics and the economics of such phenomena as market competition, institutions of private and public property, trade restrictions, g","p":"2 courses from Tier One - Individuals/Societies."},{"c":"PPEL 210","n":"Understanding the World of Commerce","u":3,"d":"Agricultural & Applied Econ","g":["S"],"at":["W"],"desc":"This course provides students with 1) a survey of business organizations as major institutions and the role of individuals as consumers, future entrep","p":"Two courses from Tier One, Individuals and Societies."},{"c":"PPEL 250","n":"The Social Contract","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"This course focuses on the idea of the social contract as it has evolved from the seventeenth century to contemporary philosophy. Can government be ju"},{"c":"PPEL 323","n":"Environmental Ethics","u":3,"d":"Philosophy","g":["B"],"at":["W"],"desc":"We will investigate and seriously consider how and why we should live as morally responsible members of an ecological community. Students will explore","p":"Two courses from Tier One, Individuals and Societies (INDV 101, 102, 103)."},{"c":"PPEL 150C1","n":"Capitalism and Socialism","u":3,"d":"Political Economy & Moral Sci","g":["B"],"at":["Q","C"],"desc":"This class is an introduction to the comparative analysis of economic systems. We will cover questions like the following: What is an economic system?"},{"c":"PRS 342","n":"The Persian World: Arts, Culture, and History","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W","C"],"desc":"This course introduces students to the Persian world's civilization through engagement with significant historical, political, cultural, and artistic "},{"c":"PSY 101","n":"Introduction to Psychology","u":4,"d":"Psychology","g":["S"],"at":["Q"],"desc":"Survey of psychology including history, systems, and methods; structure and functions of the nervous and endocrine systems; learning; motivation and e"},{"c":"PSY 200","n":"Evolution and Human Development","u":3,"d":"Educational Psychology","g":["S"],"at":["W"],"desc":"An examination of human psychological and behavioral development across the lifespan with a focus on how the processes of evolution have influenced in"},{"c":"PSY 240","n":"Developmental Psychology","u":3,"d":"Psychology","g":["B"],"at":["W"],"desc":"This course is a survey of research and theory in child development. We will examine age-related changes in the social, emotional, cognitive, and ling"},{"c":"PSY 324","n":"Fundamentals of Aging: A Multidisciplinary Perspective","u":3,"d":"Psychology","g":["B"],"at":["W"],"desc":"This course is an introduction to the scientific study of aging. In it, students will learn about the intricacies of aging from a biological, psycholo"},{"c":"PSY 336","n":"Spirituality, Psychology, and the Mind","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["W"],"desc":"Ever wonder why you believe what you believe? Ever been puzzled as to why other people believe such outrageous things? Spirituality, Psychology, and M"},{"c":"PSY 150A1","n":"The Structure of Mind and Behavior","u":4,"d":"Psychology","g":["S"],"at":["Q"],"desc":"This course serves as an introduction to mind and behavior. Broad coverage of various topics in psychology including: the science of psychology, biolo"},{"c":"PTYS 206","n":"Exploring Our Solar System","u":3,"d":"Planetary Sciences","g":["N"],"at":["W","Q"],"desc":"Our Solar System is filled with an incredible diversity of objects. These include the sun and planets, of course, but also many hundreds of moons -- s","p":"Two courses from Tier One, Natural Sciences (NATS 101, 102, 104)."},{"c":"PTYS 212","n":"Science and Politics of Climate Change","u":3,"d":"Planetary Sciences","g":["B"],"at":["W","Q"],"desc":"This course explores the science of climate change and the political and commercial issues related to global warming. The first part of the course foc"},{"c":"PTYS 214","n":"Life in the Cosmos","u":3,"d":"Planetary Sciences","g":["B"],"at":["Q","C"],"desc":"This course explores key questions in astrobiology and planetary science about the origin and evolution of life on Earth and the possibility that such"},{"c":"PTYS 170A1","n":"Alien Earths","u":3,"d":"Planetary Sciences","g":["B"],"at":["W","Q"],"desc":"Thousands of planets have been discovered orbiting nearby stars.  How many of these worlds can we expect to be Earth-like?  We explore this question f"},{"c":"PTYS 170B2","n":"Universe and Humanity: Exploring our Place in Space","u":3,"d":"Planetary Sciences","g":["N"],"at":["W","Q"],"desc":"This course places the Earth and humanity in a broad cosmic context and seeks to answer fundamental questions about our surroundings. Where are we and"},{"c":"RCSC 250","n":"Shoppers and Globalization","u":3,"d":"Retailing & Consumer Sciences","g":["B"],"at":["W","C"],"desc":"This course examines the impact of trade globalization and capitalism on the non-Western cultures and societies that produce goods. Explore how decisi"},{"c":"RCSC 150B1","n":"Consumers, Environment and Sustainability","u":3,"d":"Retailing & Consumer Sciences","g":["B"],"at":["W"],"desc":"Explore consumption and sustainability from personal, household, community, and global perspectives and examine the role of shoppers, retailers, manuf"},{"c":"RELI 203","n":"Religion and Medicine in the Western Healing Traditions","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["W","C"],"desc":"An examination of the intersection between medicine and healing in western healing traditions, from ancient times to the modern era. Key scientific an"},{"c":"RELI 211","n":"Life After Death in World Religions and Philosophies","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["C"],"desc":"This course focuses on one Big Question: \\\"How do afterlife beliefs affect the way we live?\\\" It builds connections among the humanities [Religious St","p":"Two courses from Tier One Traditions/Cultures."},{"c":"RELI 212","n":"American Indian Religious Traditions","u":3,"d":"Religious Studies, Cmt","g":["H"],"at":["C"],"desc":"This course offers a broad introduction to the diversity and complexity of American Indian religious traditions historically and in the contemporary. ","p":"Two courses from Tier One Traditions/Cultures."},{"c":"RELI 220","n":"Nature, Gods, and Zen: Religion in Japanese Society","u":3,"d":"Japanese","g":["B"],"at":["W"],"desc":"This course analyzes the history of religions in Japan and the ways in which \\\"Japanese religion\\\" is portrayed in the contemporary world. In particul","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"RELI 220A","n":"Reading the Bible: The Old Testament","u":3,"d":"English","g":["B"],"at":["C"],"desc":"Who hasn't heard of the story of Adam and Eve, the Ten Commandments, the tale of David and Goliath, the wisdom of King Solomon, or the \\\"Lord's Prayer"},{"c":"RELI 220B","n":"Reading the Bible: The New Testament","u":3,"d":"English","g":["B"],"at":["C"],"desc":"The \\\"New Testament\\\" includes some of the most famous stories we have: the crucifixion and resurrection of Jesus, the birth of the ancient Christian ","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D). Complet"},{"c":"RELI 227","n":"Religion and  Film","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["C"],"desc":"This course explores religion and its relationship with visual storytelling culture. We will analyze, explore, and challenge various religious, pop-cu"},{"c":"RELI 233","n":"Philosophy of Religion","u":3,"d":"Philosophy","g":["H"],"at":["W"],"desc":"The United States is, by all accounts, a God-fearing nation: sessions of congress are opened with a prayer, and \\\"In God We Trust\\\" is printed on the ","p":"2 courses from Tier One - Individuals/Societies."},{"c":"RELI 235","n":"Religion, Violence, and Terrorism","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["C"],"desc":"This course will study critical theories about the role of religion in acts of terrorism and violence.  Through the examination of a range of case stu","p":"2 courses from Tier One - Individuals/Societies."},{"c":"RELI 240","n":"Imagining the Buddha: Images of Buddhism in Asia and the West","u":3,"d":"Religious Studies, Cmt","g":["A"],"at":["C"],"desc":"What does it mean to imagine the Buddha? This course guides students in narrating the lives of Buddhist images by tracing their creation and movement "},{"c":"RELI 277A","n":"History of the Middle East: 600-1453","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"In this course, students take a humanistic disciplinary perspective to explore the cultural products of the pre-modern Middle East and answer question"},{"c":"RELI 280","n":"Introduction to the Bible: New Testament","u":3,"d":"Religious Studies, Cmt","g":["H"],"at":["C"],"desc":"This course introduces students to the New Testament in light of the contexts in which it was written and compiled, and as a window into reconstructin","p":"2 courses from Tier One - Traditions/Cultures."},{"c":"RELI 303","n":"Spirituality and Sickness: Religion and Health in the U.S.","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["W"],"desc":"This course explores diverse religious and spiritual conceptions of health in the United States and their relationships to experiences of sickness and","p":"Two courses from Tier One, Traditions & Cultures."},{"c":"RELI 305","n":"Greek and Roman Religion","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["C"],"desc":"Religious beliefs and cult practices in ancient Greece and Rome. All readings in English.","p":"Two courses from Tier One, Individuals and Societies (INDV 101, 102, 103)."},{"c":"RELI 306","n":"Christianity in the Greco-Roman World","u":3,"d":"Religious Studies and Classics","g":["H"],"at":["W","C"],"desc":"This course investigates the emergence of Christianity in the first four centuries of the Greco-Roman milieu. Topics may include: the interaction of e","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"RELI 316","n":"Sex and Salvation in Latin America","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["W","C"],"desc":"What do witches in colonial Guatemala, nuns in a Mexican convent, born-again gang members in El Salvador, Catholics seeking in-vitro fertilization in "},{"c":"RELI 321","n":"Women in Judaism","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"This course examines religion and gender through the study of women in Judaism. How do scholars construct a history of women in ancient Judaism when J"},{"c":"RELI 325","n":"Eastern Orthodoxy in a Global Age","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["C"],"desc":"This course focuses on the history and doctrine of Eastern Christianity from its origins in the early Church through today, emphasizing the cultural m"},{"c":"RELI 326","n":"God, Humanity & Science","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["W","C"],"desc":"This course is an examination of the role of religion and science in the construction of human worldviews and beliefs, in historical and contemporary "},{"c":"RELI 332","n":"The Holocaust: Witnesses and Representations","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["W"],"desc":"This course explores Holocaust memory and representation in Europe, Israel and the United States through various media and genres from diaries, memoir"},{"c":"RELI 334","n":"Islamic Thought","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["C"],"desc":"This course provides an overview of Islamic intellectual history from the origins of Islam to the present day. The course is divided into three units:"},{"c":"RELI 335","n":"Rap, Culture and God","u":3,"d":"Religious Studies, Cmt","g":["B"],"desc":"This course is a study of popular culture and religion in African-American and Latin@ communities, with a focus on the place of rap music in the cultu","p":"Two courses from Tier One, Traditions & Cultures."},{"c":"RELI 336","n":"Spirituality, Psychology, and the Mind","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["W"],"desc":"Ever wonder why you believe what you believe? Ever been puzzled as to why other people believe such outrageous things? Spirituality, Psychology, and M"},{"c":"RELI 350","n":"Hindu Mythology","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["C"],"desc":"Overview of the traditional Hindu narratives found in the Vedic, epic, and puranic literature. We will also examine Hindu myth in their many regional "},{"c":"RELI 358","n":"Tibetan Buddhism: Liberation, Identity, and Representation","u":3,"d":"Religious Studies, Cmt","g":["H"],"at":["C"],"desc":"How do Tibetans Buddhists innovate while staying connected with tradition? In the Tibetan language, biographies are referred to as liberation tales. I","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"RELI 359","n":"Buddhism and Healing","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["C"],"desc":"Is Buddhism a tradition of healing? In what ways has Buddhism been involved in reviving, sustaining, and curing human individuals? This course explore","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"RELI 363","n":"Religion and Sex","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["C"],"desc":"In this course, students will analyze attitudes towards sexuality in major world religions, both globally and in the context of the United States.","p":"Two courses from Tier I - Traditions/Cultures."},{"c":"RELI 367","n":"Yoga","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["C"],"desc":"In this course we examine the philosophy, practice, historical roots, and development of yoga. Students are asked to use and reflect on the disciplina","p":"Two courses in Tier One -Traditions/Cultures."},{"c":"RELI 370B","n":"History of the Jews: Cultural Loss and Resilience from the Middle Ages to the French Revolution","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["C"],"desc":"In this course, we will explore key events and themes in Jewish history from Late Antiquity to the 18th century, with a focus on Jewish life in Europe","p":"2 courses from Tier One - Individuals/Societies."},{"c":"RELI 372A","n":"Interpreting the Bible (Old Testament): Approaches to Understanding Israelite Religion and Society","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"The Hebrew Bible (Old Testament) is one of the most influential and widely studied texts in the world.  For more than two millennia, it has played a c","p":"Two courses from Tier One, Traditions and Cultures (TRAD 101,102,103,104)."},{"c":"RELI 372B","n":"Early Judaism and Christianity: One Book, Two Religions Second Temple Judaism and its Legacy","u":3,"d":"Global Studies, Sch of","g":["H"],"at":["W","C"],"desc":"This course surveys scriptures and stories, wisdom texts, histories and apocalyptic visions that Jews living in the Persian and later Greco-Roman worl","p":"Two courses from Tier One, Traditions and Cultures (TRAD 101,102,103,104)."},{"c":"RELI 379","n":"Religion in German Culture","u":3,"d":"German Studies","g":["B"],"at":["W","C"],"desc":"Introduction to major cultural figures of German speaking countries who have seen, imagined, or experienced what role religion may or can play in huma","p":"Two courses from Tier One, Traditions and Cultures (Catalog numbers 160A, 160B, 160C, 160D)."},{"c":"RELI 150B1","n":"Religion and Popular Culture","u":3,"d":"Religious Studies, Cmt","g":["B"],"desc":"This course introduces the study of religion and popular culture. It explores how religion is represented in popular cultural forms, and how social co"},{"c":"RELI 160A1","n":"Gods, Goddesses, and Demons: Divinity in South Asia","u":3,"d":"Religious Studies, Cmt","g":["H"],"at":["W","C"],"desc":"This course is an introduction to multiple concepts of the divine in South Asia. We will explore the different ways that the religious traditions of S"},{"c":"RELI 160D3","n":"Love in World Religions","u":3,"d":"Religious Studies, Cmt","g":["H"],"desc":"This course investigates various conceptions of love in world religions. The assumption of this course is that the theme of love, though interpreted i"},{"c":"RELI 160D4","n":"Introduction to World Religions","u":3,"d":"Religious Studies, Cmt","g":["H"],"at":["C"],"desc":"This course explores the diversity of religions and religious experiences across the globe. Religions to be examined include, but are not limited to, "},{"c":"RELI 160D5","n":"Spirituality, Ceremony, and Saints of the Southwest","u":3,"d":"Religious Studies, Cmt","g":["B"],"desc":"An introduction to the religious history and contemporary religious diversity of the region currently known as the American Southwest. The religious l","p":"Must not have taken RELI 250"},{"c":"RELI 160D6","n":"Gender and Religion","u":3,"d":"Religious Studies, Cmt","g":["B"],"at":["C"],"desc":"This course introduces students to the study of gender and religion. Students will consider foundational questions about the categories of religion an"},{"c":"RELI 160D7","n":"Introduction to Global Christianities","u":3,"d":"Religious Studies, Cmt","g":["H"],"at":["C"],"desc":"This course is an introduction to the academic study of Christianity in its global context. We will examine the origins of Christianity and its growth"},{"c":"RNR 240","n":"Principles of Ecotourism","u":3,"d":"Renewable Natural Resources","g":["B"],"at":["C"],"desc":"In RNR 240, we examine the principles of ecotourism and how they can be used as to conserve and manage natural and human resources in a sustainable an"},{"c":"RNR 256","n":"Sustainable Cities and Societies","u":3,"d":"Planning","g":["B"],"at":["Q"],"desc":"Cities around the globe are working to be more sustainable in response to social, economic and environmental challenges. This course explores thow res"},{"c":"RNR 150C1","n":"Sustainable Earth: Natural Resources and the Environment","u":3,"d":"Renewable Natural Resources","g":["B"],"at":["W"],"desc":"Life support systems on planet Earth are becoming progressively more challenged by a global human population that has exceeded 7 billion people. With "},{"c":"RNR 160D1","n":"Wildlife, Conservation, and Culture","u":3,"d":"Renewable Natural Resources","g":["B"],"at":["W","C"],"desc":"For as long as humans have been on earth, we have coexisted with animals on their planet. From food, to art to culture, wildlife have been symbols in "},{"c":"RNR 170C1","n":"Our Place in Nature: Biology and the Environment","u":3,"d":"Renewable Natural Resources","g":["N"],"at":["Q"],"desc":"This course involves the study of nature emphasizing humans as a component of it. We learn how living things and physical processes function and inter"},{"c":"RSSS 114","n":"How to Learn a Foreign Language","u":3,"d":"Linguistics","g":["B"],"at":["W","Q"],"desc":"The goal of the course is to provide students with important tools to help them become successful foreign language learners. Students will become fami"},{"c":"RSSS 212","n":"Mythic Russia: Russian Fairy Tales and Folklore","u":3,"d":"Russian & Slavic Studies","g":["B"],"at":["C"],"desc":"\\\"Mythic Russia\\\" is an invitation to consider a non-Western--Russian--culture's belief system as expressed in its folklore. This course comprises fou"},{"c":"RSSS 275","n":"Eastern Europe & the Balkans: Constructing Identity in Contact and Conflict","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["C"],"desc":"This course is an interdisciplinary introduction to Eastern European and Balkan cultures, primarily those of Poland, Hungary, Ukraine, and the former ","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"RSSS 280","n":"Sports and Empire: Sport in Soviet & Post-Soviet Eastern European Society","u":3,"d":"Russian & Slavic Studies","g":["B"],"at":["C"],"desc":"For almost 100 years, the Soviet Union and Russia have used large sporting events for both geopolitical and domestic purposes. In the Soviet Union spo"},{"c":"RSSS 304","n":"A History of Soviet and Post-Soviet Film","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["W","C"],"desc":"This course examines the cultural and historical context within which cinema was produced in the Soviet Union and Eastern Europe (1917-1991), as well "},{"c":"RSSS 305","n":"Russian and American Foodways: Cultivation, Culture, and Connectedness","u":3,"d":"Russian & Slavic Studies","g":["B"],"at":["C"],"desc":"Although Arizona and Russia have vastly different climates, cultures, and histories, there are more shared traditions of food cultivation, preparation","p":"Two courses from Tier One Individuals and Societies."},{"c":"RSSS 306","n":"Russian Rap from Love and Sex to Propaganda and Protest","u":3,"d":"Russian & Slavic Studies","g":["B"],"at":["C"],"desc":"Russian Rap introduces students to a more recent history of the Russian Federation and various political, social, and cultural changes through explora"},{"c":"RSSS 310","n":"Red Stars, Cosmonauts, and Robots: Soviet and East European Science Fiction","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["C"],"desc":"This course studies a selection of the best and most influential fantastic, marvelous, and uncanny works from the region that brought the world rocket"},{"c":"RSSS 315","n":"Vampires and Werewolves: Slavic & East European Folklore in our Culture","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["C"],"desc":"This course will examine the ways in which the vampire and werewolf serve as metaphors for human fears and desires. Starting with East European people"},{"c":"RSSS 320","n":"Criminal Russia: From Rasputin to Putin","u":3,"d":"Russian & Slavic Studies","g":["B"],"at":["C"],"desc":"In contemporary Russia -- marked by extreme inequality; political prosecutions; government discrimination against racial, ethnic, religious, and sexua","p":"Two courses from Tier One, Individuals and Societies."},{"c":"RSSS 325","n":"Eastern Orthodoxy in a Global Age","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["C"],"desc":"This course focuses on the history and doctrine of Eastern Christianity from its origins in the early Church through today, emphasizing the cultural m"},{"c":"RSSS 328","n":"Women in Russia and Eastern Europe","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["C"],"desc":"This course focuses on the experiences both lived and imagined of women in Russia and Eastern Europe from the nineteenth century to the present day. W","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"RSSS 335","n":"Healthy Places, Toxic Spaces: GeoHumanities & Health in  Russia & Eastern Europe","u":3,"d":"Russian & Slavic Studies","g":["B"],"at":["C"],"desc":"Space, place, and ecology have long played the part of actors - rather than backdrops - for human action in Eastern European arts; by adding the conce","p":"Two courses from Tier One Traditions and Cultures."},{"c":"RSSS 340","n":"The Pen and the Sword:  Russian Writers and Autocracy 1825-1905","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["W","C"],"desc":"This course is designed to be an introduction to the \\\"Golden Age\\\" of Russian literature. We will read a selection of classic Russian texts, with rep"},{"c":"RSSS 345","n":"World War II: The Soviet Cultural Experience","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["C"],"desc":"A cultural exploration of the Soviet experience of WWII, \\\"The Great Patriotic War.\\\" Students examine how the Soviets shaped the narrative of this co"},{"c":"RSSS 360","n":"Utopian Visions: East European Visual Culture","u":3,"d":"Russian & Slavic Studies","g":["A"],"at":["C"],"desc":"Since the 1917 Bolshevik Revolution our understanding of East European and Russian art has been defined by utopian ideas of revolutionary transformati"},{"c":"RSSS 150B1","n":"East European Cinema in Social Context","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["C"],"desc":"East European Cinema in a Social Context (RSSS150) introduces students to a variety of excellent films that have come out of Eastern Europe in the las"},{"c":"RSSS 150B2","n":"Multicultural Russia","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["C"],"desc":"This course explores the diverse ethnic, linguistic, religious, and cultural identities of Russia's population, including the history of how such iden"},{"c":"RSSS 160C2","n":"Contemporary Russia in a Historical and Global Context","u":3,"d":"Russian & Slavic Studies","g":["H"],"at":["C"],"desc":"This course examines contemporary Russian culture and politics in a historical context, determining how the country's past influences present day cult"},{"c":"RSSS 160D1","n":"Introduction to Russia Through Music","u":3,"d":"Russian & Slavic Studies","g":["B"],"at":["C"],"desc":"This course will introduce students to Russian history and culture as reflected in the country's music. Students will examine Russian folklore, religi"},{"c":"SBS 320","n":"Consequences of Capitalism","u":3,"d":"Social & Behavioral Sci Admin","g":["B"],"at":["W"],"desc":"Beginning with an overview of the formal and informal mechanisms that shape our views of the world, the course will examine how industrial state capit"},{"c":"SBS 350","n":"Introduction to Adobe Creative Cloud for Multimedia Projects","u":3,"d":"Social & Behavioral Sci Admin","g":["A"],"at":["W"],"desc":"In this course students will learn to produce multimedia projects through a rhetoric lens using Adobe Creative Cloud. They will becoming familiar with"},{"c":"SERP 200","n":"Mass Media and Its Construction of Disability","u":3,"d":"Disability & Psychoed Studies","g":["S"],"desc":"Enrolled students will explore and recognize how disability is constructed in American mass media. They will analyze the influence of these constructi"},{"c":"SERP 212","n":"Application of Research in Social Emotional Development of Children and Adolescents","u":3,"d":"Disability & Psychoed Studies","g":["S"],"at":["W"],"desc":"This course is designed for students to develop an applied understanding of social science/educational research related to social emotional developmen"},{"c":"SERP 416","n":"Disability Perspectives and Narratives","u":3,"d":"Disability & Psychoed Studies","g":["S"],"desc":"Exploration of the disability lived experience and societal perspectives and their impact; key concepts include ableism, normalcy, language, identity,","p":"Open to juniors and seniors only."},{"c":"SGPP 384","n":"International Human Rights, Transitional Justice, and Israel","u":3,"d":"Global Studies, Sch of","g":["B"],"at":["C"],"desc":"This course will introduce students to international human rights principles and aspects of transitional justice, while also allowing for them to unde"},{"c":"SLHS 207","n":"Survey of Human Communication and Its Disorders","u":3,"d":"Speech Language & Hearing Sci","g":["B"],"desc":"This class will introduce us to the work of Speech-Language Pathologists and Audiologists. We will talk about the anatomy of the vocal tract, the brai"},{"c":"SLHS 255","n":"Hearing, Health and Society","u":3,"d":"Speech Language & Hearing Sci","g":["S"],"desc":"This course introduces students to critical thinking in relation to hearing loss and quality of life issues associated with a disability across the li"},{"c":"SLHS 263","n":"The World of Sound","u":3,"d":"Speech Language & Hearing Sci","g":["N"],"at":["Q"],"desc":"Sound is everywhere and this class will introduce to all aspects of sound. We will cover the physical characteristics of sound and how we can represen"},{"c":"SOC 101","n":"Introduction to Sociology","u":3,"d":"Sociology, Sch of","g":["S"],"desc":"This course will encourage students to think critically about how society shapes and constrains human behavior through the lens of a social scientist."},{"c":"SOC 202","n":"Connecting Society and Health","u":3,"d":"Sociology, Sch of","g":["B"],"desc":"Why are some people healthier than others? Biology and medicine tell us that some people are biologically or genetically predisposed to be more or les","p":"2 courses from Tier One - Individuals/ Societies."},{"c":"SOC 222","n":"Gender Identities, Interactions and Relationships","u":3,"d":"Sociology, Sch of","g":["S"],"desc":"The sociological study of how gender identities form and influence interactions in friendships, intimate relations, families, education, and other ins"},{"c":"SOC 241","n":"Criminal Justice Administration","u":3,"d":"Govt & Pub Policy, Sch of","g":["S"],"at":["Q"],"desc":"This  course  is  designed  as  a  general  survey  of  the  criminal  justice system in the United States. We begin with a general discussion of the "},{"c":"SOC 260","n":"Ethnic and Race Relations in the United States","u":3,"d":"Sociology, Sch of","g":["S"],"desc":"Analysis of minority relations and mass movements in urban society; trends in the modern world, with special reference to present-day race problems an","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"SOC 320","n":"Why so Few?  Women in the Professions","u":3,"d":"Sociology, Sch of","g":["B"],"at":["Q"],"desc":"The goal of this course is to investigate women's representation in the professions.  Women make up half the population and have earned more than half","p":"2 courses from Tier One - Individuals/Societies"},{"c":"SOC 324","n":"Sociology of Sexuality","u":3,"d":"Sociology, Sch of","g":["S"],"desc":"The social construction and historical emergence of gender and sexual identities, attitudes, norms, and behaviors. Impact of individual and community "},{"c":"SOC 325","n":"Men and Masculinities","u":3,"d":"Sociology, Sch of","g":["S"],"desc":"This course is meant to be an in-depth examination of men's lives and an exploration of sociological perspectives on masculinity. Although the course "},{"c":"SOC 355","n":"International Migration & Migrants","u":3,"d":"Sociology, Sch of","g":["S"],"desc":"Migration is a phenomenon of central interest and an important area of study in the social sciences. It has also become a fiercely debated politic top","p":"2 courses from Tier One - Individuals/Societies."},{"c":"SOC 367","n":"Population Geography","u":3,"d":"Geography & Dev, Sch of","g":["S"],"desc":"In this course, students explore the characteristics, geographic distribution, and growth/decline of population at local, regional, national, and glob","p":"Two courses from Tier One, Individuals and Societies (Catalog numbers 150A, 150B, 150C)."},{"c":"SOC 432","n":"Urban Community","u":3,"d":"Sociology, Sch of","g":["S"],"at":["Q"],"desc":"Analysis of social, economic, and political processes that underlie the social organization of urban community, with special reference to contemporary"},{"c":"SOC 448","n":"Sociology of the Body","u":3,"d":"Sociology, Sch of","g":["S"],"desc":"Too often, human bodies are missing from social scientific and lay models of human behavior and thought.  Sociologists of the Body seek to correct thi"},{"c":"SOC 459","n":"Constructions of Gender","u":3,"d":"Sociology, Sch of","g":["S"],"desc":"This course uses the concept of social construction to analyze how gender organizes our social experiences. It shows how cultural understandings of ge"},{"c":"SOC 150B1","n":"Social Issues in America","u":3,"d":"Sociology, Sch of","g":["S"],"at":["W"],"desc":"The primary objective of the course is to provide students with an opportunity to become conversant with and think critically about various contempora"},{"c":"SOC 150B2","n":"Gender, Power, and Inequality","u":3,"d":"Sociology, Sch of","g":["B"],"at":["W"],"desc":"This course examines gender as a \\\"taken for granted\\\" social difference in our society. We begin by examining definitions of gender. Do gender and bi"},{"c":"SOC 150C2","n":"The Good Society","u":3,"d":"Sociology, Sch of","g":["S"],"desc":"What institutions are conducive to prosperity, freedom, capabilities, democracy, security, peace, justice, community, health, and happiness?  To what "},{"c":"SPAN 210","n":"Latin America on Film","u":3,"d":"Spanish","g":["B"],"at":["W","C"],"desc":"Throughout its history, Latin America has witnessed a conflict of social, cultural and political differences. The challenges of defining Latin America"},{"c":"SPAN 280","n":"Brazilian Identity: Class, Race, and Citizenship","u":3,"d":"Global Studies, Sch of","g":["S"],"at":["W"],"desc":"This course takes representations and experiences of citizenship in modern Brazil as the springboard for the study of cross-cultural membership in soc","p":"2 courses from Tier I - Individuals/Societies."},{"c":"SPAN 150B1","n":"Latino/a/x Stories","u":3,"d":"Spanish","g":["B"],"desc":"This course introduces students to the Latina/o/x experience in the United States through exploring its expressive culture. Students will analyze a va"},{"c":"SPAN 160C1","n":"The Arts and Politics in Latin America","u":3,"d":"Spanish","g":["A"],"at":["C"],"desc":"This course deals with the relationship between politics and cultural expressions in Latin America. These cultural expressions studied are literature,"},{"c":"SPAN 160D1","n":"Issues in Latin American Society and Popular Culture","u":3,"d":"Spanish","g":["B"],"at":["W","C"],"desc":"This course is an introduction to fundamental concepts, practices, and approaches to the study of popular culture and politics in Latin America. We wi"},{"c":"SRL 201","n":"Using Physical Activity to Explore the Human Body","u":3,"d":"Tch, Lrn & Sociocultural Stdy","g":["N"],"at":["Q"],"desc":"This course encourages students to approach physical activity, the human body, stress management, and health and wellness from a natural scientist per"},{"c":"SRL 353","n":"Recreation and Leisure in Contemporary Society","u":3,"d":"Tch, Lrn & Sociocultural Stdy","g":["B"],"at":["W"],"desc":"Students in this course will gain a broad level understanding of the theoretical foundations that shape the recreation and leisure studies field, how "},{"c":"SRL 359","n":"The Power of Parks","u":3,"d":"Tch, Lrn & Sociocultural Stdy","g":["B"],"at":["W"],"desc":"Picture a majestic sunset view from the rim of the Grand Canyon. Now, imagine the sounds of laughter and splashing water at a local community pool. Bo"},{"c":"SRL 150B1","n":"Sport, Leisure and Consumer Culture","u":3,"d":"Tch, Lrn & Sociocultural Stdy","g":["S"],"at":["W"],"desc":"This course will encourage you to think critically about practices of sport, leisure, and consumption through the lens of a social scientist. We will "},{"c":"TAR 100","n":"Acting for Everyone","u":3,"d":"Theatre, Film & Television,Sch","g":["A"],"at":["W"],"desc":"This course explores the perspective of an artist through the lens of acting. You will practice and develop your performance skills through twice week"},{"c":"TAR 103","n":"Broadway and Beyond: The Art and Process of Theatre","u":3,"d":"Theatre, Film & Television,Sch","g":["A"],"at":["W"],"desc":"What is performed art and how do artists create theatrical events?  What qualities are inherent in the artistic process of making theatre? What choice","p":"Open to non-majors only."},{"c":"TAR 303","n":"Ritual to Rap:  Voices of American Musical Theatre","u":3,"d":"Theatre, Film & Television,Sch","g":["A"],"at":["W"],"desc":"How do American musicals inform our society's relationship with, and understanding of, marginalized and oppressed groups?  What do we learn about our "},{"c":"TFTV 160D1","n":"Popular Entertainment","u":3,"d":"Theatre, Film & Television,Sch","g":["A"],"at":["W"],"desc":"What is entertainment?  What makes entertainment popular?  What is the process for creating entertainments that will be popular with audiences?  This "},{"c":"TLS 200","n":"Sustainability and Education","u":3,"d":"Tch, Lrn & Sociocultural Stdy","g":["B"],"at":["C"],"desc":"This course will explore the complex web of relationships between environmental, economic, and social systems. It will explore these interrelationship"},{"c":"TLS 240","n":"Ancient Athletics","u":3,"d":"Religious Studies and Classics","g":["B"],"at":["W","C"],"desc":"This course investigates athletics, sport, and spectacle in ancient Greece and Rome. From the birth of the ancient Olympics in the early days of archa"},{"c":"TLS 250","n":"Hope in Dark Times: Exploring Social Issues through Youth Literature","u":3,"d":"Tch, Lrn & Sociocultural Stdy","g":["H"],"desc":"This course explores social issues by reading and responding to youth literature set in culturally-diverse local and global communities through a huma"},{"c":"TLS 253","n":"Teaching Online by Design","u":3,"d":"Tch, Lrn & Sociocultural Stdy","g":["B"],"desc":"This course is a broad overview that will introduce students to the issues surrounding online education. The challenges and opportunities of designing"},{"c":"TLS 331","n":"National Parks, Museums, and Zoos: America's Largest Classrooms","u":3,"d":"Tch, Lrn & Sociocultural Stdy","g":["B"],"at":["W"],"desc":"National parks, museums, and zoos represent mosaics of national heritage, universally shared human experiences, compelling stories of identity, recrea"},{"c":"TLS 150C1","n":"Social Equity & Justice in K-12 Schooling: Race, Class, Disability, Immigration, & LGBTQ+ Issues","u":3,"d":"Tch, Lrn & Sociocultural Stdy","g":["S"],"at":["W"],"desc":"Students will be exposed to and engage critically with the ways in which minoritized student populations (e.g., working-class, poor, students of color"},{"c":"WFSC 140","n":"Wildlife at the Movies","u":3,"d":"Nat Resources & Eviron, Sch","g":["A"],"at":["W","Q"],"desc":"This course explores wildlife fictional films as a way to create solutions for human challenges while exploring uncomfortable or even taboo human expe"},{"c":"WFSC 223","n":"Dealing With Data in the Wild","u":3,"d":"Wildlife and Fisheries Science","g":["B"],"at":["W","Q"],"desc":"Do you want to live permanently in Antarctica? Now is your chance, apply for Mission Antarctica! The ice is melting, the penguins are marching; it see","p":"Two courses from Tier One Natural Sciences."}]